Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0xdef (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 27 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x19623): GNU C11 12.3.1 20230626 -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x6a7ac): ../Core/Src/LoRa.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0xcacb): C:/Users/buikh/workspace/MY_THESIS/STM32_SCRIPT/f103_lora_test/lora_sender/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 9 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x3e9ee): signed char
 <1><31>: Abbrev Number: 5 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x24d39): __uint8_t
    <36>   DW_AT_decl_file   : 2
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 9 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0x19b67): unsigned char
 <1><44>: Abbrev Number: 9 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 2
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0x5cb1d): short int
 <1><4b>: Abbrev Number: 5 (DW_TAG_typedef)
    <4c>   DW_AT_name        : (indirect string, offset: 0x65ec4): __uint16_t
    <50>   DW_AT_decl_file   : 2
    <51>   DW_AT_decl_line   : 57
    <52>   DW_AT_decl_column : 25
    <53>   DW_AT_type        : <0x57>
 <1><57>: Abbrev Number: 9 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 7	(unsigned)
    <5a>   DW_AT_name        : (indirect string, offset: 0x29362): short unsigned int
 <1><5e>: Abbrev Number: 9 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 4
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0xafda): long int
 <1><65>: Abbrev Number: 5 (DW_TAG_typedef)
    <66>   DW_AT_name        : (indirect string, offset: 0x4f622): __uint32_t
    <6a>   DW_AT_decl_file   : 2
    <6b>   DW_AT_decl_line   : 79
    <6c>   DW_AT_decl_column : 25
    <6d>   DW_AT_type        : <0x71>
 <1><71>: Abbrev Number: 9 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 4
    <73>   DW_AT_encoding    : 7	(unsigned)
    <74>   DW_AT_name        : (indirect string, offset: 0x1db32): long unsigned int
 <1><78>: Abbrev Number: 9 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 8
    <7a>   DW_AT_encoding    : 5	(signed)
    <7b>   DW_AT_name        : (indirect string, offset: 0x39656): long long int
 <1><7f>: Abbrev Number: 9 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 8
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0x1a28e): long long unsigned int
 <1><86>: Abbrev Number: 28 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : int
 <1><8d>: Abbrev Number: 9 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0xa96b): unsigned int
 <1><94>: Abbrev Number: 5 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x24d3b): uint8_t
    <99>   DW_AT_decl_file   : 3
    <9a>   DW_AT_decl_line   : 24
    <9b>   DW_AT_decl_column : 19
    <9c>   DW_AT_type        : <0x31>
 <1><a0>: Abbrev Number: 23 (DW_TAG_const_type)
    <a1>   DW_AT_type        : <0x94>
 <1><a5>: Abbrev Number: 5 (DW_TAG_typedef)
    <a6>   DW_AT_name        : (indirect string, offset: 0x65ec6): uint16_t
    <aa>   DW_AT_decl_file   : 3
    <ab>   DW_AT_decl_line   : 36
    <ac>   DW_AT_decl_column : 20
    <ad>   DW_AT_type        : <0x4b>
 <1><b1>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <b2>   DW_AT_type        : <0xa5>
 <1><b6>: Abbrev Number: 5 (DW_TAG_typedef)
    <b7>   DW_AT_name        : (indirect string, offset: 0x4f624): uint32_t
    <bb>   DW_AT_decl_file   : 3
    <bc>   DW_AT_decl_line   : 48
    <bd>   DW_AT_decl_column : 20
    <be>   DW_AT_type        : <0x65>
 <1><c2>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <c3>   DW_AT_type        : <0xb6>
 <1><c7>: Abbrev Number: 18 (DW_TAG_structure_type)
    <c8>   DW_AT_byte_size   : 16
    <c9>   DW_AT_decl_file   : 4
    <c9>   DW_AT_decl_line   : 290
    <cb>   DW_AT_decl_column : 9
    <cb>   DW_AT_sibling     : <0x100>
 <2><cf>: Abbrev Number: 10 (DW_TAG_member)
    <d0>   DW_AT_name        : CCR
    <d4>   DW_AT_decl_file   : 4
    <d4>   DW_AT_decl_line   : 292
    <d6>   DW_AT_decl_column : 17
    <d6>   DW_AT_type        : <0xc2>
    <da>   DW_AT_data_member_location: 0
 <2><db>: Abbrev Number: 11 (DW_TAG_member)
    <dc>   DW_AT_name        : (indirect string, offset: 0x306c8): CNDTR
    <e0>   DW_AT_decl_file   : 4
    <e0>   DW_AT_decl_line   : 293
    <e2>   DW_AT_decl_column : 17
    <e2>   DW_AT_type        : <0xc2>
    <e6>   DW_AT_data_member_location: 4
 <2><e7>: Abbrev Number: 11 (DW_TAG_member)
    <e8>   DW_AT_name        : (indirect string, offset: 0x77877): CPAR
    <ec>   DW_AT_decl_file   : 4
    <ec>   DW_AT_decl_line   : 294
    <ee>   DW_AT_decl_column : 17
    <ee>   DW_AT_type        : <0xc2>
    <f2>   DW_AT_data_member_location: 8
 <2><f3>: Abbrev Number: 11 (DW_TAG_member)
    <f4>   DW_AT_name        : (indirect string, offset: 0x44ed6): CMAR
    <f8>   DW_AT_decl_file   : 4
    <f8>   DW_AT_decl_line   : 295
    <fa>   DW_AT_decl_column : 17
    <fa>   DW_AT_type        : <0xc2>
    <fe>   DW_AT_data_member_location: 12
 <2><ff>: Abbrev Number: 0
 <1><100>: Abbrev Number: 19 (DW_TAG_typedef)
    <101>   DW_AT_name        : (indirect string, offset: 0x65708): DMA_Channel_TypeDef
    <105>   DW_AT_decl_file   : 4
    <105>   DW_AT_decl_line   : 296
    <107>   DW_AT_decl_column : 3
    <107>   DW_AT_type        : <0xc7>
 <1><10b>: Abbrev Number: 18 (DW_TAG_structure_type)
    <10c>   DW_AT_byte_size   : 8
    <10d>   DW_AT_decl_file   : 4
    <10d>   DW_AT_decl_line   : 298
    <10f>   DW_AT_decl_column : 9
    <10f>   DW_AT_sibling     : <0x12c>
 <2><113>: Abbrev Number: 10 (DW_TAG_member)
    <114>   DW_AT_name        : ISR
    <118>   DW_AT_decl_file   : 4
    <118>   DW_AT_decl_line   : 300
    <11a>   DW_AT_decl_column : 17
    <11a>   DW_AT_type        : <0xc2>
    <11e>   DW_AT_data_member_location: 0
 <2><11f>: Abbrev Number: 11 (DW_TAG_member)
    <120>   DW_AT_name        : (indirect string, offset: 0x577ad): IFCR
    <124>   DW_AT_decl_file   : 4
    <124>   DW_AT_decl_line   : 301
    <126>   DW_AT_decl_column : 17
    <126>   DW_AT_type        : <0xc2>
    <12a>   DW_AT_data_member_location: 4
 <2><12b>: Abbrev Number: 0
 <1><12c>: Abbrev Number: 19 (DW_TAG_typedef)
    <12d>   DW_AT_name        : (indirect string, offset: 0x2da79): DMA_TypeDef
    <131>   DW_AT_decl_file   : 4
    <131>   DW_AT_decl_line   : 302
    <133>   DW_AT_decl_column : 3
    <133>   DW_AT_type        : <0x10b>
 <1><137>: Abbrev Number: 18 (DW_TAG_structure_type)
    <138>   DW_AT_byte_size   : 28
    <139>   DW_AT_decl_file   : 4
    <139>   DW_AT_decl_line   : 357
    <13b>   DW_AT_decl_column : 9
    <13b>   DW_AT_sibling     : <0x194>
 <2><13f>: Abbrev Number: 10 (DW_TAG_member)
    <140>   DW_AT_name        : CRL
    <144>   DW_AT_decl_file   : 4
    <144>   DW_AT_decl_line   : 359
    <146>   DW_AT_decl_column : 17
    <146>   DW_AT_type        : <0xc2>
    <14a>   DW_AT_data_member_location: 0
 <2><14b>: Abbrev Number: 10 (DW_TAG_member)
    <14c>   DW_AT_name        : CRH
    <150>   DW_AT_decl_file   : 4
    <150>   DW_AT_decl_line   : 360
    <152>   DW_AT_decl_column : 17
    <152>   DW_AT_type        : <0xc2>
    <156>   DW_AT_data_member_location: 4
 <2><157>: Abbrev Number: 10 (DW_TAG_member)
    <158>   DW_AT_name        : IDR
    <15c>   DW_AT_decl_file   : 4
    <15c>   DW_AT_decl_line   : 361
    <15e>   DW_AT_decl_column : 17
    <15e>   DW_AT_type        : <0xc2>
    <162>   DW_AT_data_member_location: 8
 <2><163>: Abbrev Number: 10 (DW_TAG_member)
    <164>   DW_AT_name        : ODR
    <168>   DW_AT_decl_file   : 4
    <168>   DW_AT_decl_line   : 362
    <16a>   DW_AT_decl_column : 17
    <16a>   DW_AT_type        : <0xc2>
    <16e>   DW_AT_data_member_location: 12
 <2><16f>: Abbrev Number: 11 (DW_TAG_member)
    <170>   DW_AT_name        : (indirect string, offset: 0x1c2f0): BSRR
    <174>   DW_AT_decl_file   : 4
    <174>   DW_AT_decl_line   : 363
    <176>   DW_AT_decl_column : 17
    <176>   DW_AT_type        : <0xc2>
    <17a>   DW_AT_data_member_location: 16
 <2><17b>: Abbrev Number: 10 (DW_TAG_member)
    <17c>   DW_AT_name        : BRR
    <180>   DW_AT_decl_file   : 4
    <180>   DW_AT_decl_line   : 364
    <182>   DW_AT_decl_column : 17
    <182>   DW_AT_type        : <0xc2>
    <186>   DW_AT_data_member_location: 20
 <2><187>: Abbrev Number: 11 (DW_TAG_member)
    <188>   DW_AT_name        : (indirect string, offset: 0x6aec3): LCKR
    <18c>   DW_AT_decl_file   : 4
    <18c>   DW_AT_decl_line   : 365
    <18e>   DW_AT_decl_column : 17
    <18e>   DW_AT_type        : <0xc2>
    <192>   DW_AT_data_member_location: 24
 <2><193>: Abbrev Number: 0
 <1><194>: Abbrev Number: 19 (DW_TAG_typedef)
    <195>   DW_AT_name        : (indirect string, offset: 0x7828d): GPIO_TypeDef
    <199>   DW_AT_decl_file   : 4
    <199>   DW_AT_decl_line   : 366
    <19b>   DW_AT_decl_column : 3
    <19b>   DW_AT_type        : <0x137>
 <1><19f>: Abbrev Number: 18 (DW_TAG_structure_type)
    <1a0>   DW_AT_byte_size   : 32
    <1a1>   DW_AT_decl_file   : 4
    <1a1>   DW_AT_decl_line   : 461
    <1a3>   DW_AT_decl_column : 9
    <1a3>   DW_AT_sibling     : <0x206>
 <2><1a7>: Abbrev Number: 10 (DW_TAG_member)
    <1a8>   DW_AT_name        : CR1
    <1ac>   DW_AT_decl_file   : 4
    <1ac>   DW_AT_decl_line   : 463
    <1ae>   DW_AT_decl_column : 17
    <1ae>   DW_AT_type        : <0xc2>
    <1b2>   DW_AT_data_member_location: 0
 <2><1b3>: Abbrev Number: 10 (DW_TAG_member)
    <1b4>   DW_AT_name        : CR2
    <1b8>   DW_AT_decl_file   : 4
    <1b8>   DW_AT_decl_line   : 464
    <1ba>   DW_AT_decl_column : 17
    <1ba>   DW_AT_type        : <0xc2>
    <1be>   DW_AT_data_member_location: 4
 <2><1bf>: Abbrev Number: 10 (DW_TAG_member)
    <1c0>   DW_AT_name        : SR
    <1c3>   DW_AT_decl_file   : 4
    <1c3>   DW_AT_decl_line   : 465
    <1c5>   DW_AT_decl_column : 17
    <1c5>   DW_AT_type        : <0xc2>
    <1c9>   DW_AT_data_member_location: 8
 <2><1ca>: Abbrev Number: 10 (DW_TAG_member)
    <1cb>   DW_AT_name        : DR
    <1ce>   DW_AT_decl_file   : 4
    <1ce>   DW_AT_decl_line   : 466
    <1d0>   DW_AT_decl_column : 17
    <1d0>   DW_AT_type        : <0xc2>
    <1d4>   DW_AT_data_member_location: 12
 <2><1d5>: Abbrev Number: 11 (DW_TAG_member)
    <1d6>   DW_AT_name        : (indirect string, offset: 0x1e505): CRCPR
    <1da>   DW_AT_decl_file   : 4
    <1da>   DW_AT_decl_line   : 467
    <1dc>   DW_AT_decl_column : 17
    <1dc>   DW_AT_type        : <0xc2>
    <1e0>   DW_AT_data_member_location: 16
 <2><1e1>: Abbrev Number: 11 (DW_TAG_member)
    <1e2>   DW_AT_name        : (indirect string, offset: 0x4a090): RXCRCR
    <1e6>   DW_AT_decl_file   : 4
    <1e6>   DW_AT_decl_line   : 468
    <1e8>   DW_AT_decl_column : 17
    <1e8>   DW_AT_type        : <0xc2>
    <1ec>   DW_AT_data_member_location: 20
 <2><1ed>: Abbrev Number: 11 (DW_TAG_member)
    <1ee>   DW_AT_name        : (indirect string, offset: 0x3e64e): TXCRCR
    <1f2>   DW_AT_decl_file   : 4
    <1f2>   DW_AT_decl_line   : 469
    <1f4>   DW_AT_decl_column : 17
    <1f4>   DW_AT_type        : <0xc2>
    <1f8>   DW_AT_data_member_location: 24
 <2><1f9>: Abbrev Number: 11 (DW_TAG_member)
    <1fa>   DW_AT_name        : (indirect string, offset: 0x7a746): I2SCFGR
    <1fe>   DW_AT_decl_file   : 4
    <1fe>   DW_AT_decl_line   : 470
    <200>   DW_AT_decl_column : 17
    <200>   DW_AT_type        : <0xc2>
    <204>   DW_AT_data_member_location: 28
 <2><205>: Abbrev Number: 0
 <1><206>: Abbrev Number: 19 (DW_TAG_typedef)
    <207>   DW_AT_name        : (indirect string, offset: 0x1d2ea): SPI_TypeDef
    <20b>   DW_AT_decl_file   : 4
    <20b>   DW_AT_decl_line   : 471
    <20d>   DW_AT_decl_column : 3
    <20d>   DW_AT_type        : <0x19f>
 <1><211>: Abbrev Number: 9 (DW_TAG_base_type)
    <212>   DW_AT_byte_size   : 8
    <213>   DW_AT_encoding    : 4	(float)
    <214>   DW_AT_name        : (indirect string, offset: 0x7cce0): long double
 <1><218>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <219>   DW_AT_encoding    : 7	(unsigned)
    <219>   DW_AT_byte_size   : 1
    <219>   DW_AT_type        : <0x3d>
    <21d>   DW_AT_decl_file   : 5
    <21e>   DW_AT_decl_line   : 39
    <21f>   DW_AT_decl_column : 1
    <21f>   DW_AT_sibling     : <0x23c>
 <2><223>: Abbrev Number: 3 (DW_TAG_enumerator)
    <224>   DW_AT_name        : (indirect string, offset: 0x2a799): HAL_OK
    <228>   DW_AT_const_value : 0
 <2><229>: Abbrev Number: 3 (DW_TAG_enumerator)
    <22a>   DW_AT_name        : (indirect string, offset: 0x4e08c): HAL_ERROR
    <22e>   DW_AT_const_value : 1
 <2><22f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <230>   DW_AT_name        : (indirect string, offset: 0x16131): HAL_BUSY
    <234>   DW_AT_const_value : 2
 <2><235>: Abbrev Number: 3 (DW_TAG_enumerator)
    <236>   DW_AT_name        : (indirect string, offset: 0x251f8): HAL_TIMEOUT
    <23a>   DW_AT_const_value : 3
 <2><23b>: Abbrev Number: 0
 <1><23c>: Abbrev Number: 5 (DW_TAG_typedef)
    <23d>   DW_AT_name        : (indirect string, offset: 0x15b1): HAL_StatusTypeDef
    <241>   DW_AT_decl_file   : 5
    <242>   DW_AT_decl_line   : 44
    <243>   DW_AT_decl_column : 3
    <244>   DW_AT_type        : <0x218>
 <1><248>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <249>   DW_AT_encoding    : 7	(unsigned)
    <249>   DW_AT_byte_size   : 1
    <249>   DW_AT_type        : <0x3d>
    <24d>   DW_AT_decl_file   : 5
    <24e>   DW_AT_decl_line   : 50
    <24f>   DW_AT_decl_column : 1
    <24f>   DW_AT_sibling     : <0x260>
 <2><253>: Abbrev Number: 3 (DW_TAG_enumerator)
    <254>   DW_AT_name        : (indirect string, offset: 0x5c2ae): HAL_UNLOCKED
    <258>   DW_AT_const_value : 0
 <2><259>: Abbrev Number: 3 (DW_TAG_enumerator)
    <25a>   DW_AT_name        : (indirect string, offset: 0x7bec3): HAL_LOCKED
    <25e>   DW_AT_const_value : 1
 <2><25f>: Abbrev Number: 0
 <1><260>: Abbrev Number: 5 (DW_TAG_typedef)
    <261>   DW_AT_name        : (indirect string, offset: 0x498d7): HAL_LockTypeDef
    <265>   DW_AT_decl_file   : 5
    <266>   DW_AT_decl_line   : 53
    <267>   DW_AT_decl_column : 3
    <268>   DW_AT_type        : <0x248>
 <1><26c>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <26d>   DW_AT_encoding    : 7	(unsigned)
    <26d>   DW_AT_byte_size   : 1
    <26d>   DW_AT_type        : <0x3d>
    <271>   DW_AT_decl_file   : 6
    <272>   DW_AT_decl_line   : 65
    <273>   DW_AT_decl_column : 1
    <273>   DW_AT_sibling     : <0x284>
 <2><277>: Abbrev Number: 3 (DW_TAG_enumerator)
    <278>   DW_AT_name        : (indirect string, offset: 0x1a021): GPIO_PIN_RESET
    <27c>   DW_AT_const_value : 0
 <2><27d>: Abbrev Number: 3 (DW_TAG_enumerator)
    <27e>   DW_AT_name        : (indirect string, offset: 0x16388): GPIO_PIN_SET
    <282>   DW_AT_const_value : 1
 <2><283>: Abbrev Number: 0
 <1><284>: Abbrev Number: 5 (DW_TAG_typedef)
    <285>   DW_AT_name        : (indirect string, offset: 0x79853): GPIO_PinState
    <289>   DW_AT_decl_file   : 6
    <28a>   DW_AT_decl_line   : 68
    <28b>   DW_AT_decl_column : 3
    <28c>   DW_AT_type        : <0x26c>
 <1><290>: Abbrev Number: 24 (DW_TAG_structure_type)
    <291>   DW_AT_byte_size   : 28
    <292>   DW_AT_decl_file   : 7
    <293>   DW_AT_decl_line   : 47
    <294>   DW_AT_decl_column : 9
    <294>   DW_AT_sibling     : <0x2f4>
 <2><298>: Abbrev Number: 1 (DW_TAG_member)
    <299>   DW_AT_name        : (indirect string, offset: 0x2e711): Direction
    <29d>   DW_AT_decl_file   : 7
    <29e>   DW_AT_decl_line   : 49
    <29f>   DW_AT_decl_column : 12
    <2a0>   DW_AT_type        : <0xb6>
    <2a4>   DW_AT_data_member_location: 0
 <2><2a5>: Abbrev Number: 1 (DW_TAG_member)
    <2a6>   DW_AT_name        : (indirect string, offset: 0x8a48): PeriphInc
    <2aa>   DW_AT_decl_file   : 7
    <2ab>   DW_AT_decl_line   : 53
    <2ac>   DW_AT_decl_column : 12
    <2ad>   DW_AT_type        : <0xb6>
    <2b1>   DW_AT_data_member_location: 4
 <2><2b2>: Abbrev Number: 1 (DW_TAG_member)
    <2b3>   DW_AT_name        : (indirect string, offset: 0x13e02): MemInc
    <2b7>   DW_AT_decl_file   : 7
    <2b8>   DW_AT_decl_line   : 56
    <2b9>   DW_AT_decl_column : 12
    <2ba>   DW_AT_type        : <0xb6>
    <2be>   DW_AT_data_member_location: 8
 <2><2bf>: Abbrev Number: 1 (DW_TAG_member)
    <2c0>   DW_AT_name        : (indirect string, offset: 0x3e2ad): PeriphDataAlignment
    <2c4>   DW_AT_decl_file   : 7
    <2c5>   DW_AT_decl_line   : 59
    <2c6>   DW_AT_decl_column : 12
    <2c7>   DW_AT_type        : <0xb6>
    <2cb>   DW_AT_data_member_location: 12
 <2><2cc>: Abbrev Number: 1 (DW_TAG_member)
    <2cd>   DW_AT_name        : (indirect string, offset: 0x7040b): MemDataAlignment
    <2d1>   DW_AT_decl_file   : 7
    <2d2>   DW_AT_decl_line   : 62
    <2d3>   DW_AT_decl_column : 12
    <2d4>   DW_AT_type        : <0xb6>
    <2d8>   DW_AT_data_member_location: 16
 <2><2d9>: Abbrev Number: 1 (DW_TAG_member)
    <2da>   DW_AT_name        : (indirect string, offset: 0x481d7): Mode
    <2de>   DW_AT_decl_file   : 7
    <2df>   DW_AT_decl_line   : 65
    <2e0>   DW_AT_decl_column : 12
    <2e1>   DW_AT_type        : <0xb6>
    <2e5>   DW_AT_data_member_location: 20
 <2><2e6>: Abbrev Number: 1 (DW_TAG_member)
    <2e7>   DW_AT_name        : (indirect string, offset: 0x82d3e): Priority
    <2eb>   DW_AT_decl_file   : 7
    <2ec>   DW_AT_decl_line   : 70
    <2ed>   DW_AT_decl_column : 12
    <2ee>   DW_AT_type        : <0xb6>
    <2f2>   DW_AT_data_member_location: 24
 <2><2f3>: Abbrev Number: 0
 <1><2f4>: Abbrev Number: 5 (DW_TAG_typedef)
    <2f5>   DW_AT_name        : (indirect string, offset: 0x21e3f): DMA_InitTypeDef
    <2f9>   DW_AT_decl_file   : 7
    <2fa>   DW_AT_decl_line   : 72
    <2fb>   DW_AT_decl_column : 3
    <2fc>   DW_AT_type        : <0x290>
 <1><300>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <301>   DW_AT_encoding    : 7	(unsigned)
    <301>   DW_AT_byte_size   : 1
    <301>   DW_AT_type        : <0x3d>
    <305>   DW_AT_decl_file   : 7
    <306>   DW_AT_decl_line   : 78
    <307>   DW_AT_decl_column : 1
    <307>   DW_AT_sibling     : <0x324>
 <2><30b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <30c>   DW_AT_name        : (indirect string, offset: 0x5cdaf): HAL_DMA_STATE_RESET
    <310>   DW_AT_const_value : 0
 <2><311>: Abbrev Number: 3 (DW_TAG_enumerator)
    <312>   DW_AT_name        : (indirect string, offset: 0x22b11): HAL_DMA_STATE_READY
    <316>   DW_AT_const_value : 1
 <2><317>: Abbrev Number: 3 (DW_TAG_enumerator)
    <318>   DW_AT_name        : (indirect string, offset: 0x569e7): HAL_DMA_STATE_BUSY
    <31c>   DW_AT_const_value : 2
 <2><31d>: Abbrev Number: 3 (DW_TAG_enumerator)
    <31e>   DW_AT_name        : (indirect string, offset: 0x79b4b): HAL_DMA_STATE_TIMEOUT
    <322>   DW_AT_const_value : 3
 <2><323>: Abbrev Number: 0
 <1><324>: Abbrev Number: 5 (DW_TAG_typedef)
    <325>   DW_AT_name        : (indirect string, offset: 0x44cbf): HAL_DMA_StateTypeDef
    <329>   DW_AT_decl_file   : 7
    <32a>   DW_AT_decl_line   : 83
    <32b>   DW_AT_decl_column : 2
    <32c>   DW_AT_type        : <0x300>
 <1><330>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <331>   DW_AT_type        : <0x324>
 <1><335>: Abbrev Number: 20 (DW_TAG_structure_type)
    <336>   DW_AT_name        : (indirect string, offset: 0x6a2bc): __DMA_HandleTypeDef
    <33a>   DW_AT_byte_size   : 68
    <33b>   DW_AT_decl_file   : 7
    <33c>   DW_AT_decl_line   : 110
    <33d>   DW_AT_decl_column : 16
    <33d>   DW_AT_sibling     : <0x3de>
 <2><341>: Abbrev Number: 1 (DW_TAG_member)
    <342>   DW_AT_name        : (indirect string, offset: 0x30d43): Instance
    <346>   DW_AT_decl_file   : 7
    <347>   DW_AT_decl_line   : 112
    <348>   DW_AT_decl_column : 31
    <349>   DW_AT_type        : <0x3de>
    <34d>   DW_AT_data_member_location: 0
 <2><34e>: Abbrev Number: 1 (DW_TAG_member)
    <34f>   DW_AT_name        : (indirect string, offset: 0x7e0f9): Init
    <353>   DW_AT_decl_file   : 7
    <354>   DW_AT_decl_line   : 114
    <355>   DW_AT_decl_column : 30
    <356>   DW_AT_type        : <0x2f4>
    <35a>   DW_AT_data_member_location: 4
 <2><35b>: Abbrev Number: 1 (DW_TAG_member)
    <35c>   DW_AT_name        : (indirect string, offset: 0x58e95): Lock
    <360>   DW_AT_decl_file   : 7
    <361>   DW_AT_decl_line   : 116
    <362>   DW_AT_decl_column : 30
    <363>   DW_AT_type        : <0x260>
    <367>   DW_AT_data_member_location: 32
 <2><368>: Abbrev Number: 1 (DW_TAG_member)
    <369>   DW_AT_name        : (indirect string, offset: 0x7e981): State
    <36d>   DW_AT_decl_file   : 7
    <36e>   DW_AT_decl_line   : 118
    <36f>   DW_AT_decl_column : 30
    <370>   DW_AT_type        : <0x330>
    <374>   DW_AT_data_member_location: 33
 <2><375>: Abbrev Number: 1 (DW_TAG_member)
    <376>   DW_AT_name        : (indirect string, offset: 0x75c27): Parent
    <37a>   DW_AT_decl_file   : 7
    <37b>   DW_AT_decl_line   : 120
    <37c>   DW_AT_decl_column : 31
    <37d>   DW_AT_type        : <0x3e3>
    <381>   DW_AT_data_member_location: 36
 <2><382>: Abbrev Number: 1 (DW_TAG_member)
    <383>   DW_AT_name        : (indirect string, offset: 0x7b44e): XferCpltCallback
    <387>   DW_AT_decl_file   : 7
    <388>   DW_AT_decl_line   : 122
    <389>   DW_AT_decl_column : 33
    <38a>   DW_AT_type        : <0x3f5>
    <38e>   DW_AT_data_member_location: 40
 <2><38f>: Abbrev Number: 1 (DW_TAG_member)
    <390>   DW_AT_name        : (indirect string, offset: 0x60d67): XferHalfCpltCallback
    <394>   DW_AT_decl_file   : 7
    <395>   DW_AT_decl_line   : 124
    <396>   DW_AT_decl_column : 33
    <397>   DW_AT_type        : <0x3f5>
    <39b>   DW_AT_data_member_location: 44
 <2><39c>: Abbrev Number: 1 (DW_TAG_member)
    <39d>   DW_AT_name        : (indirect string, offset: 0x1223c): XferErrorCallback
    <3a1>   DW_AT_decl_file   : 7
    <3a2>   DW_AT_decl_line   : 126
    <3a3>   DW_AT_decl_column : 33
    <3a4>   DW_AT_type        : <0x3f5>
    <3a8>   DW_AT_data_member_location: 48
 <2><3a9>: Abbrev Number: 1 (DW_TAG_member)
    <3aa>   DW_AT_name        : (indirect string, offset: 0x73b86): XferAbortCallback
    <3ae>   DW_AT_decl_file   : 7
    <3af>   DW_AT_decl_line   : 128
    <3b0>   DW_AT_decl_column : 33
    <3b1>   DW_AT_type        : <0x3f5>
    <3b5>   DW_AT_data_member_location: 52
 <2><3b6>: Abbrev Number: 1 (DW_TAG_member)
    <3b7>   DW_AT_name        : (indirect string, offset: 0x78ef0): ErrorCode
    <3bb>   DW_AT_decl_file   : 7
    <3bc>   DW_AT_decl_line   : 130
    <3bd>   DW_AT_decl_column : 30
    <3be>   DW_AT_type        : <0xc2>
    <3c2>   DW_AT_data_member_location: 56
 <2><3c3>: Abbrev Number: 1 (DW_TAG_member)
    <3c4>   DW_AT_name        : (indirect string, offset: 0x35a82): DmaBaseAddress
    <3c8>   DW_AT_decl_file   : 7
    <3c9>   DW_AT_decl_line   : 132
    <3ca>   DW_AT_decl_column : 31
    <3cb>   DW_AT_type        : <0x3fa>
    <3cf>   DW_AT_data_member_location: 60
 <2><3d0>: Abbrev Number: 1 (DW_TAG_member)
    <3d1>   DW_AT_name        : (indirect string, offset: 0x1a0b2): ChannelIndex
    <3d5>   DW_AT_decl_file   : 7
    <3d6>   DW_AT_decl_line   : 134
    <3d7>   DW_AT_decl_column : 30
    <3d8>   DW_AT_type        : <0xb6>
    <3dc>   DW_AT_data_member_location: 64
 <2><3dd>: Abbrev Number: 0
 <1><3de>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <3df>   DW_AT_byte_size   : 4
    <3df>   DW_AT_type        : <0x100>
 <1><3e3>: Abbrev Number: 29 (DW_TAG_pointer_type)
    <3e4>   DW_AT_byte_size   : 4
 <1><3e5>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <3e6>   DW_AT_prototyped  : 1
    <3e6>   DW_AT_sibling     : <0x3f0>
 <2><3ea>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <3eb>   DW_AT_type        : <0x3f0>
 <2><3ef>: Abbrev Number: 0
 <1><3f0>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <3f1>   DW_AT_byte_size   : 4
    <3f1>   DW_AT_type        : <0x335>
 <1><3f5>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <3f6>   DW_AT_byte_size   : 4
    <3f6>   DW_AT_type        : <0x3e5>
 <1><3fa>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <3fb>   DW_AT_byte_size   : 4
    <3fb>   DW_AT_type        : <0x12c>
 <1><3ff>: Abbrev Number: 5 (DW_TAG_typedef)
    <400>   DW_AT_name        : (indirect string, offset: 0x6a2be): DMA_HandleTypeDef
    <404>   DW_AT_decl_file   : 7
    <405>   DW_AT_decl_line   : 136
    <406>   DW_AT_decl_column : 3
    <407>   DW_AT_type        : <0x335>
 <1><40b>: Abbrev Number: 24 (DW_TAG_structure_type)
    <40c>   DW_AT_byte_size   : 44
    <40d>   DW_AT_decl_file   : 8
    <40e>   DW_AT_decl_line   : 46
    <40f>   DW_AT_decl_column : 9
    <40f>   DW_AT_sibling     : <0x4a3>
 <2><413>: Abbrev Number: 1 (DW_TAG_member)
    <414>   DW_AT_name        : (indirect string, offset: 0x481d7): Mode
    <418>   DW_AT_decl_file   : 8
    <419>   DW_AT_decl_line   : 48
    <41a>   DW_AT_decl_column : 12
    <41b>   DW_AT_type        : <0xb6>
    <41f>   DW_AT_data_member_location: 0
 <2><420>: Abbrev Number: 1 (DW_TAG_member)
    <421>   DW_AT_name        : (indirect string, offset: 0x2e711): Direction
    <425>   DW_AT_decl_file   : 8
    <426>   DW_AT_decl_line   : 51
    <427>   DW_AT_decl_column : 12
    <428>   DW_AT_type        : <0xb6>
    <42c>   DW_AT_data_member_location: 4
 <2><42d>: Abbrev Number: 1 (DW_TAG_member)
    <42e>   DW_AT_name        : (indirect string, offset: 0x5faf0): DataSize
    <432>   DW_AT_decl_file   : 8
    <433>   DW_AT_decl_line   : 54
    <434>   DW_AT_decl_column : 12
    <435>   DW_AT_type        : <0xb6>
    <439>   DW_AT_data_member_location: 8
 <2><43a>: Abbrev Number: 1 (DW_TAG_member)
    <43b>   DW_AT_name        : (indirect string, offset: 0x1a35e): CLKPolarity
    <43f>   DW_AT_decl_file   : 8
    <440>   DW_AT_decl_line   : 57
    <441>   DW_AT_decl_column : 12
    <442>   DW_AT_type        : <0xb6>
    <446>   DW_AT_data_member_location: 12
 <2><447>: Abbrev Number: 1 (DW_TAG_member)
    <448>   DW_AT_name        : (indirect string, offset: 0x26b19): CLKPhase
    <44c>   DW_AT_decl_file   : 8
    <44d>   DW_AT_decl_line   : 60
    <44e>   DW_AT_decl_column : 12
    <44f>   DW_AT_type        : <0xb6>
    <453>   DW_AT_data_member_location: 16
 <2><454>: Abbrev Number: 30 (DW_TAG_member)
    <455>   DW_AT_name        : NSS
    <459>   DW_AT_decl_file   : 8
    <45a>   DW_AT_decl_line   : 63
    <45b>   DW_AT_decl_column : 12
    <45c>   DW_AT_type        : <0xb6>
    <460>   DW_AT_data_member_location: 20
 <2><461>: Abbrev Number: 1 (DW_TAG_member)
    <462>   DW_AT_name        : (indirect string, offset: 0x10cdc): BaudRatePrescaler
    <466>   DW_AT_decl_file   : 8
    <467>   DW_AT_decl_line   : 67
    <468>   DW_AT_decl_column : 12
    <469>   DW_AT_type        : <0xb6>
    <46d>   DW_AT_data_member_location: 24
 <2><46e>: Abbrev Number: 1 (DW_TAG_member)
    <46f>   DW_AT_name        : (indirect string, offset: 0x6f228): FirstBit
    <473>   DW_AT_decl_file   : 8
    <474>   DW_AT_decl_line   : 73
    <475>   DW_AT_decl_column : 12
    <476>   DW_AT_type        : <0xb6>
    <47a>   DW_AT_data_member_location: 28
 <2><47b>: Abbrev Number: 1 (DW_TAG_member)
    <47c>   DW_AT_name        : (indirect string, offset: 0x481d5): TIMode
    <480>   DW_AT_decl_file   : 8
    <481>   DW_AT_decl_line   : 76
    <482>   DW_AT_decl_column : 12
    <483>   DW_AT_type        : <0xb6>
    <487>   DW_AT_data_member_location: 32
 <2><488>: Abbrev Number: 1 (DW_TAG_member)
    <489>   DW_AT_name        : (indirect string, offset: 0x59291): CRCCalculation
    <48d>   DW_AT_decl_file   : 8
    <48e>   DW_AT_decl_line   : 79
    <48f>   DW_AT_decl_column : 12
    <490>   DW_AT_type        : <0xb6>
    <494>   DW_AT_data_member_location: 36
 <2><495>: Abbrev Number: 1 (DW_TAG_member)
    <496>   DW_AT_name        : (indirect string, offset: 0x5bc6b): CRCPolynomial
    <49a>   DW_AT_decl_file   : 8
    <49b>   DW_AT_decl_line   : 82
    <49c>   DW_AT_decl_column : 12
    <49d>   DW_AT_type        : <0xb6>
    <4a1>   DW_AT_data_member_location: 40
 <2><4a2>: Abbrev Number: 0
 <1><4a3>: Abbrev Number: 5 (DW_TAG_typedef)
    <4a4>   DW_AT_name        : (indirect string, offset: 0x179a9): SPI_InitTypeDef
    <4a8>   DW_AT_decl_file   : 8
    <4a9>   DW_AT_decl_line   : 84
    <4aa>   DW_AT_decl_column : 3
    <4ab>   DW_AT_type        : <0x40b>
 <1><4af>: Abbrev Number: 15 (DW_TAG_enumeration_type)
    <4b0>   DW_AT_encoding    : 7	(unsigned)
    <4b0>   DW_AT_byte_size   : 1
    <4b0>   DW_AT_type        : <0x3d>
    <4b4>   DW_AT_decl_file   : 8
    <4b5>   DW_AT_decl_line   : 90
    <4b6>   DW_AT_decl_column : 1
    <4b6>   DW_AT_sibling     : <0x4eb>
 <2><4ba>: Abbrev Number: 3 (DW_TAG_enumerator)
    <4bb>   DW_AT_name        : (indirect string, offset: 0x52985): HAL_SPI_STATE_RESET
    <4bf>   DW_AT_const_value : 0
 <2><4c0>: Abbrev Number: 3 (DW_TAG_enumerator)
    <4c1>   DW_AT_name        : (indirect string, offset: 0x18580): HAL_SPI_STATE_READY
    <4c5>   DW_AT_const_value : 1
 <2><4c6>: Abbrev Number: 3 (DW_TAG_enumerator)
    <4c7>   DW_AT_name        : (indirect string, offset: 0x68f8): HAL_SPI_STATE_BUSY
    <4cb>   DW_AT_const_value : 2
 <2><4cc>: Abbrev Number: 3 (DW_TAG_enumerator)
    <4cd>   DW_AT_name        : (indirect string, offset: 0x44059): HAL_SPI_STATE_BUSY_TX
    <4d1>   DW_AT_const_value : 3
 <2><4d2>: Abbrev Number: 3 (DW_TAG_enumerator)
    <4d3>   DW_AT_name        : (indirect string, offset: 0x4389b): HAL_SPI_STATE_BUSY_RX
    <4d7>   DW_AT_const_value : 4
 <2><4d8>: Abbrev Number: 3 (DW_TAG_enumerator)
    <4d9>   DW_AT_name        : (indirect string, offset: 0x1393d): HAL_SPI_STATE_BUSY_TX_RX
    <4dd>   DW_AT_const_value : 5
 <2><4de>: Abbrev Number: 3 (DW_TAG_enumerator)
    <4df>   DW_AT_name        : (indirect string, offset: 0x60780): HAL_SPI_STATE_ERROR
    <4e3>   DW_AT_const_value : 6
 <2><4e4>: Abbrev Number: 3 (DW_TAG_enumerator)
    <4e5>   DW_AT_name        : (indirect string, offset: 0x124b0): HAL_SPI_STATE_ABORT
    <4e9>   DW_AT_const_value : 7
 <2><4ea>: Abbrev Number: 0
 <1><4eb>: Abbrev Number: 5 (DW_TAG_typedef)
    <4ec>   DW_AT_name        : (indirect string, offset: 0x702e9): HAL_SPI_StateTypeDef
    <4f0>   DW_AT_decl_file   : 8
    <4f1>   DW_AT_decl_line   : 99
    <4f2>   DW_AT_decl_column : 3
    <4f3>   DW_AT_type        : <0x4af>
 <1><4f7>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <4f8>   DW_AT_type        : <0x4eb>
 <1><4fc>: Abbrev Number: 20 (DW_TAG_structure_type)
    <4fd>   DW_AT_name        : (indirect string, offset: 0x6eb82): __SPI_HandleTypeDef
    <501>   DW_AT_byte_size   : 88
    <502>   DW_AT_decl_file   : 8
    <503>   DW_AT_decl_line   : 104
    <504>   DW_AT_decl_column : 16
    <504>   DW_AT_sibling     : <0x5cc>
 <2><508>: Abbrev Number: 1 (DW_TAG_member)
    <509>   DW_AT_name        : (indirect string, offset: 0x30d43): Instance
    <50d>   DW_AT_decl_file   : 8
    <50e>   DW_AT_decl_line   : 106
    <50f>   DW_AT_decl_column : 31
    <510>   DW_AT_type        : <0x5cc>
    <514>   DW_AT_data_member_location: 0
 <2><515>: Abbrev Number: 1 (DW_TAG_member)
    <516>   DW_AT_name        : (indirect string, offset: 0x7e0f9): Init
    <51a>   DW_AT_decl_file   : 8
    <51b>   DW_AT_decl_line   : 108
    <51c>   DW_AT_decl_column : 30
    <51d>   DW_AT_type        : <0x4a3>
    <521>   DW_AT_data_member_location: 4
 <2><522>: Abbrev Number: 1 (DW_TAG_member)
    <523>   DW_AT_name        : (indirect string, offset: 0x3bff8): pTxBuffPtr
    <527>   DW_AT_decl_file   : 8
    <528>   DW_AT_decl_line   : 110
    <529>   DW_AT_decl_column : 31
    <52a>   DW_AT_type        : <0x5d1>
    <52e>   DW_AT_data_member_location: 48
 <2><52f>: Abbrev Number: 1 (DW_TAG_member)
    <530>   DW_AT_name        : (indirect string, offset: 0x35180): TxXferSize
    <534>   DW_AT_decl_file   : 8
    <535>   DW_AT_decl_line   : 112
    <536>   DW_AT_decl_column : 30
    <537>   DW_AT_type        : <0xa5>
    <53b>   DW_AT_data_member_location: 52
 <2><53c>: Abbrev Number: 1 (DW_TAG_member)
    <53d>   DW_AT_name        : (indirect string, offset: 0x83a7b): TxXferCount
    <541>   DW_AT_decl_file   : 8
    <542>   DW_AT_decl_line   : 114
    <543>   DW_AT_decl_column : 30
    <544>   DW_AT_type        : <0xb1>
    <548>   DW_AT_data_member_location: 54
 <2><549>: Abbrev Number: 1 (DW_TAG_member)
    <54a>   DW_AT_name        : (indirect string, offset: 0x73226): pRxBuffPtr
    <54e>   DW_AT_decl_file   : 8
    <54f>   DW_AT_decl_line   : 116
    <550>   DW_AT_decl_column : 31
    <551>   DW_AT_type        : <0x5d6>
    <555>   DW_AT_data_member_location: 56
 <2><556>: Abbrev Number: 1 (DW_TAG_member)
    <557>   DW_AT_name        : (indirect string, offset: 0x3b7d8): RxXferSize
    <55b>   DW_AT_decl_file   : 8
    <55c>   DW_AT_decl_line   : 118
    <55d>   DW_AT_decl_column : 30
    <55e>   DW_AT_type        : <0xa5>
    <562>   DW_AT_data_member_location: 60
 <2><563>: Abbrev Number: 1 (DW_TAG_member)
    <564>   DW_AT_name        : (indirect string, offset: 0x4b0b2): RxXferCount
    <568>   DW_AT_decl_file   : 8
    <569>   DW_AT_decl_line   : 120
    <56a>   DW_AT_decl_column : 30
    <56b>   DW_AT_type        : <0xb1>
    <56f>   DW_AT_data_member_location: 62
 <2><570>: Abbrev Number: 1 (DW_TAG_member)
    <571>   DW_AT_name        : (indirect string, offset: 0x6b5f6): RxISR
    <575>   DW_AT_decl_file   : 8
    <576>   DW_AT_decl_line   : 122
    <577>   DW_AT_decl_column : 10
    <578>   DW_AT_type        : <0x5eb>
    <57c>   DW_AT_data_member_location: 64
 <2><57d>: Abbrev Number: 1 (DW_TAG_member)
    <57e>   DW_AT_name        : (indirect string, offset: 0x3e9da): TxISR
    <582>   DW_AT_decl_file   : 8
    <583>   DW_AT_decl_line   : 124
    <584>   DW_AT_decl_column : 10
    <585>   DW_AT_type        : <0x5eb>
    <589>   DW_AT_data_member_location: 68
 <2><58a>: Abbrev Number: 1 (DW_TAG_member)
    <58b>   DW_AT_name        : (indirect string, offset: 0x78885): hdmatx
    <58f>   DW_AT_decl_file   : 8
    <590>   DW_AT_decl_line   : 126
    <591>   DW_AT_decl_column : 31
    <592>   DW_AT_type        : <0x5f0>
    <596>   DW_AT_data_member_location: 72
 <2><597>: Abbrev Number: 1 (DW_TAG_member)
    <598>   DW_AT_name        : (indirect string, offset: 0x78070): hdmarx
    <59c>   DW_AT_decl_file   : 8
    <59d>   DW_AT_decl_line   : 128
    <59e>   DW_AT_decl_column : 31
    <59f>   DW_AT_type        : <0x5f0>
    <5a3>   DW_AT_data_member_location: 76
 <2><5a4>: Abbrev Number: 1 (DW_TAG_member)
    <5a5>   DW_AT_name        : (indirect string, offset: 0x58e95): Lock
    <5a9>   DW_AT_decl_file   : 8
    <5aa>   DW_AT_decl_line   : 130
    <5ab>   DW_AT_decl_column : 30
    <5ac>   DW_AT_type        : <0x260>
    <5b0>   DW_AT_data_member_location: 80
 <2><5b1>: Abbrev Number: 1 (DW_TAG_member)
    <5b2>   DW_AT_name        : (indirect string, offset: 0x7e981): State
    <5b6>   DW_AT_decl_file   : 8
    <5b7>   DW_AT_decl_line   : 132
    <5b8>   DW_AT_decl_column : 30
    <5b9>   DW_AT_type        : <0x4f7>
    <5bd>   DW_AT_data_member_location: 81
 <2><5be>: Abbrev Number: 1 (DW_TAG_member)
    <5bf>   DW_AT_name        : (indirect string, offset: 0x78ef0): ErrorCode
    <5c3>   DW_AT_decl_file   : 8
    <5c4>   DW_AT_decl_line   : 134
    <5c5>   DW_AT_decl_column : 30
    <5c6>   DW_AT_type        : <0xc2>
    <5ca>   DW_AT_data_member_location: 84
 <2><5cb>: Abbrev Number: 0
 <1><5cc>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <5cd>   DW_AT_byte_size   : 4
    <5cd>   DW_AT_type        : <0x206>
 <1><5d1>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <5d2>   DW_AT_byte_size   : 4
    <5d2>   DW_AT_type        : <0xa0>
 <1><5d6>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <5d7>   DW_AT_byte_size   : 4
    <5d7>   DW_AT_type        : <0x94>
 <1><5db>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <5dc>   DW_AT_prototyped  : 1
    <5dc>   DW_AT_sibling     : <0x5e6>
 <2><5e0>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <5e1>   DW_AT_type        : <0x5e6>
 <2><5e5>: Abbrev Number: 0
 <1><5e6>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <5e7>   DW_AT_byte_size   : 4
    <5e7>   DW_AT_type        : <0x4fc>
 <1><5eb>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <5ec>   DW_AT_byte_size   : 4
    <5ec>   DW_AT_type        : <0x5db>
 <1><5f0>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <5f1>   DW_AT_byte_size   : 4
    <5f1>   DW_AT_type        : <0x3ff>
 <1><5f5>: Abbrev Number: 5 (DW_TAG_typedef)
    <5f6>   DW_AT_name        : (indirect string, offset: 0x6eb84): SPI_HandleTypeDef
    <5fa>   DW_AT_decl_file   : 8
    <5fb>   DW_AT_decl_line   : 149
    <5fc>   DW_AT_decl_column : 3
    <5fd>   DW_AT_type        : <0x4fc>
 <1><601>: Abbrev Number: 23 (DW_TAG_const_type)
    <602>   DW_AT_type        : <0x5f5>
 <1><606>: Abbrev Number: 20 (DW_TAG_structure_type)
    <607>   DW_AT_name        : (indirect string, offset: 0x73029): LoRa_setting
    <60b>   DW_AT_byte_size   : 44
    <60c>   DW_AT_decl_file   : 9
    <60d>   DW_AT_decl_line   : 87
    <60e>   DW_AT_decl_column : 16
    <60e>   DW_AT_sibling     : <0x6d6>
 <2><612>: Abbrev Number: 1 (DW_TAG_member)
    <613>   DW_AT_name        : (indirect string, offset: 0x36028): CS_port
    <617>   DW_AT_decl_file   : 9
    <618>   DW_AT_decl_line   : 90
    <619>   DW_AT_decl_column : 17
    <61a>   DW_AT_type        : <0x6d6>
    <61e>   DW_AT_data_member_location: 0
 <2><61f>: Abbrev Number: 1 (DW_TAG_member)
    <620>   DW_AT_name        : (indirect string, offset: 0x5e953): CS_pin
    <624>   DW_AT_decl_file   : 9
    <625>   DW_AT_decl_line   : 91
    <626>   DW_AT_decl_column : 12
    <627>   DW_AT_type        : <0xa5>
    <62b>   DW_AT_data_member_location: 4
 <2><62c>: Abbrev Number: 1 (DW_TAG_member)
    <62d>   DW_AT_name        : (indirect string, offset: 0x5bbc0): reset_port
    <631>   DW_AT_decl_file   : 9
    <632>   DW_AT_decl_line   : 92
    <633>   DW_AT_decl_column : 17
    <634>   DW_AT_type        : <0x6d6>
    <638>   DW_AT_data_member_location: 8
 <2><639>: Abbrev Number: 1 (DW_TAG_member)
    <63a>   DW_AT_name        : (indirect string, offset: 0xcc69): reset_pin
    <63e>   DW_AT_decl_file   : 9
    <63f>   DW_AT_decl_line   : 93
    <640>   DW_AT_decl_column : 12
    <641>   DW_AT_type        : <0xa5>
    <645>   DW_AT_data_member_location: 12
 <2><646>: Abbrev Number: 1 (DW_TAG_member)
    <647>   DW_AT_name        : (indirect string, offset: 0x6fdc3): DIO0_port
    <64b>   DW_AT_decl_file   : 9
    <64c>   DW_AT_decl_line   : 94
    <64d>   DW_AT_decl_column : 17
    <64e>   DW_AT_type        : <0x6d6>
    <652>   DW_AT_data_member_location: 16
 <2><653>: Abbrev Number: 1 (DW_TAG_member)
    <654>   DW_AT_name        : (indirect string, offset: 0x741c8): DIO0_pin
    <658>   DW_AT_decl_file   : 9
    <659>   DW_AT_decl_line   : 95
    <65a>   DW_AT_decl_column : 12
    <65b>   DW_AT_type        : <0xa5>
    <65f>   DW_AT_data_member_location: 20
 <2><660>: Abbrev Number: 1 (DW_TAG_member)
    <661>   DW_AT_name        : (indirect string, offset: 0x53ef): hSPIx
    <665>   DW_AT_decl_file   : 9
    <666>   DW_AT_decl_line   : 96
    <667>   DW_AT_decl_column : 21
    <668>   DW_AT_type        : <0x6db>
    <66c>   DW_AT_data_member_location: 24
 <2><66d>: Abbrev Number: 1 (DW_TAG_member)
    <66e>   DW_AT_name        : (indirect string, offset: 0x3b51b): current_mode
    <672>   DW_AT_decl_file   : 9
    <673>   DW_AT_decl_line   : 99
    <674>   DW_AT_decl_column : 8
    <675>   DW_AT_type        : <0x86>
    <679>   DW_AT_data_member_location: 28
 <2><67a>: Abbrev Number: 1 (DW_TAG_member)
    <67b>   DW_AT_name        : (indirect string, offset: 0xba1a): frequency
    <67f>   DW_AT_decl_file   : 9
    <680>   DW_AT_decl_line   : 100
    <681>   DW_AT_decl_column : 9
    <682>   DW_AT_type        : <0x86>
    <686>   DW_AT_data_member_location: 32
 <2><687>: Abbrev Number: 1 (DW_TAG_member)
    <688>   DW_AT_name        : (indirect string, offset: 0x3dca0): spredingFactor
    <68c>   DW_AT_decl_file   : 9
    <68d>   DW_AT_decl_line   : 101
    <68e>   DW_AT_decl_column : 12
    <68f>   DW_AT_type        : <0x94>
    <693>   DW_AT_data_member_location: 36
 <2><694>: Abbrev Number: 1 (DW_TAG_member)
    <695>   DW_AT_name        : (indirect string, offset: 0x144d0): bandWidth
    <699>   DW_AT_decl_file   : 9
    <69a>   DW_AT_decl_line   : 102
    <69b>   DW_AT_decl_column : 12
    <69c>   DW_AT_type        : <0x94>
    <6a0>   DW_AT_data_member_location: 37
 <2><6a1>: Abbrev Number: 1 (DW_TAG_member)
    <6a2>   DW_AT_name        : (indirect string, offset: 0x1e63e): crcRate
    <6a6>   DW_AT_decl_file   : 9
    <6a7>   DW_AT_decl_line   : 103
    <6a8>   DW_AT_decl_column : 12
    <6a9>   DW_AT_type        : <0x94>
    <6ad>   DW_AT_data_member_location: 38
 <2><6ae>: Abbrev Number: 1 (DW_TAG_member)
    <6af>   DW_AT_name        : (indirect string, offset: 0x1f567): preamble
    <6b3>   DW_AT_decl_file   : 9
    <6b4>   DW_AT_decl_line   : 104
    <6b5>   DW_AT_decl_column : 12
    <6b6>   DW_AT_type        : <0xa5>
    <6ba>   DW_AT_data_member_location: 40
 <2><6bb>: Abbrev Number: 1 (DW_TAG_member)
    <6bc>   DW_AT_name        : (indirect string, offset: 0x13a4c): power
    <6c0>   DW_AT_decl_file   : 9
    <6c1>   DW_AT_decl_line   : 105
    <6c2>   DW_AT_decl_column : 12
    <6c3>   DW_AT_type        : <0x94>
    <6c7>   DW_AT_data_member_location: 42
 <2><6c8>: Abbrev Number: 1 (DW_TAG_member)
    <6c9>   DW_AT_name        : (indirect string, offset: 0xf1d8): overCurrentProtection
    <6cd>   DW_AT_decl_file   : 9
    <6ce>   DW_AT_decl_line   : 106
    <6cf>   DW_AT_decl_column : 12
    <6d0>   DW_AT_type        : <0x94>
    <6d4>   DW_AT_data_member_location: 43
 <2><6d5>: Abbrev Number: 0
 <1><6d6>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <6d7>   DW_AT_byte_size   : 4
    <6d7>   DW_AT_type        : <0x194>
 <1><6db>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <6dc>   DW_AT_byte_size   : 4
    <6dc>   DW_AT_type        : <0x5f5>
 <1><6e0>: Abbrev Number: 5 (DW_TAG_typedef)
    <6e1>   DW_AT_name        : (indirect string, offset: 0x64cd1): LoRa
    <6e5>   DW_AT_decl_file   : 9
    <6e6>   DW_AT_decl_line   : 108
    <6e7>   DW_AT_decl_column : 3
    <6e8>   DW_AT_type        : <0x606>
 <1><6ec>: Abbrev Number: 21 (DW_TAG_subprogram)
    <6ed>   DW_AT_external    : 1
    <6ed>   DW_AT_name        : (indirect string, offset: 0x21210): HAL_SPI_Receive
    <6f1>   DW_AT_decl_file   : 8
    <6f1>   DW_AT_decl_line   : 676
    <6f3>   DW_AT_decl_column : 19
    <6f4>   DW_AT_prototyped  : 1
    <6f4>   DW_AT_type        : <0x23c>
    <6f8>   DW_AT_declaration : 1
    <6f8>   DW_AT_sibling     : <0x711>
 <2><6fc>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <6fd>   DW_AT_type        : <0x6db>
 <2><701>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <702>   DW_AT_type        : <0x5d6>
 <2><706>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <707>   DW_AT_type        : <0xa5>
 <2><70b>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <70c>   DW_AT_type        : <0xb6>
 <2><710>: Abbrev Number: 0
 <1><711>: Abbrev Number: 21 (DW_TAG_subprogram)
    <712>   DW_AT_external    : 1
    <712>   DW_AT_name        : (indirect string, offset: 0x8d46): HAL_SPI_GetState
    <716>   DW_AT_decl_file   : 8
    <716>   DW_AT_decl_line   : 711
    <718>   DW_AT_decl_column : 22
    <719>   DW_AT_prototyped  : 1
    <719>   DW_AT_type        : <0x4eb>
    <71d>   DW_AT_declaration : 1
    <71d>   DW_AT_sibling     : <0x727>
 <2><721>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <722>   DW_AT_type        : <0x727>
 <2><726>: Abbrev Number: 0
 <1><727>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <728>   DW_AT_byte_size   : 4
    <728>   DW_AT_type        : <0x601>
 <1><72c>: Abbrev Number: 21 (DW_TAG_subprogram)
    <72d>   DW_AT_external    : 1
    <72d>   DW_AT_name        : (indirect string, offset: 0x23fd): HAL_SPI_Transmit
    <731>   DW_AT_decl_file   : 8
    <731>   DW_AT_decl_line   : 675
    <733>   DW_AT_decl_column : 19
    <734>   DW_AT_prototyped  : 1
    <734>   DW_AT_type        : <0x23c>
    <738>   DW_AT_declaration : 1
    <738>   DW_AT_sibling     : <0x751>
 <2><73c>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <73d>   DW_AT_type        : <0x6db>
 <2><741>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <742>   DW_AT_type        : <0x5d1>
 <2><746>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <747>   DW_AT_type        : <0xa5>
 <2><74b>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <74c>   DW_AT_type        : <0xb6>
 <2><750>: Abbrev Number: 0
 <1><751>: Abbrev Number: 31 (DW_TAG_subprogram)
    <752>   DW_AT_external    : 1
    <752>   DW_AT_name        : (indirect string, offset: 0x3215f): HAL_Delay
    <756>   DW_AT_decl_file   : 10
    <757>   DW_AT_decl_line   : 296
    <759>   DW_AT_decl_column : 6
    <75a>   DW_AT_prototyped  : 1
    <75a>   DW_AT_declaration : 1
    <75a>   DW_AT_sibling     : <0x764>
 <2><75e>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <75f>   DW_AT_type        : <0xb6>
 <2><763>: Abbrev Number: 0
 <1><764>: Abbrev Number: 32 (DW_TAG_subprogram)
    <765>   DW_AT_external    : 1
    <765>   DW_AT_name        : (indirect string, offset: 0x166d9): HAL_GPIO_WritePin
    <769>   DW_AT_decl_file   : 6
    <76a>   DW_AT_decl_line   : 234
    <76b>   DW_AT_decl_column : 6
    <76c>   DW_AT_prototyped  : 1
    <76c>   DW_AT_declaration : 1
    <76c>   DW_AT_sibling     : <0x780>
 <2><770>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <771>   DW_AT_type        : <0x6d6>
 <2><775>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <776>   DW_AT_type        : <0xa5>
 <2><77a>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <77b>   DW_AT_type        : <0x284>
 <2><77f>: Abbrev Number: 0
 <1><780>: Abbrev Number: 16 (DW_TAG_subprogram)
    <781>   DW_AT_external    : 1
    <781>   DW_AT_name        : (indirect string, offset: 0x5c23c): LoRa_init
    <785>   DW_AT_decl_file   : 1
    <785>   DW_AT_decl_line   : 528
    <787>   DW_AT_decl_column : 10
    <788>   DW_AT_prototyped  : 1
    <788>   DW_AT_type        : <0xa5>
    <78c>   DW_AT_low_pc      : 0x8001330
    <790>   DW_AT_high_pc     : 0x14e
    <794>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <796>   DW_AT_call_all_tail_calls: 1
    <796>   DW_AT_sibling     : <0x7c8>
 <2><79a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <79b>   DW_AT_name        : (indirect string, offset: 0x64cd0): _LoRa
    <79f>   DW_AT_decl_file   : 1
    <79f>   DW_AT_decl_line   : 528
    <7a1>   DW_AT_decl_column : 26
    <7a2>   DW_AT_type        : <0x7c8>
    <7a6>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><7a9>: Abbrev Number: 7 (DW_TAG_variable)
    <7aa>   DW_AT_name        : (indirect string, offset: 0x6b2e7): data
    <7ae>   DW_AT_decl_file   : 1
    <7ae>   DW_AT_decl_line   : 529
    <7b0>   DW_AT_decl_column : 13
    <7b1>   DW_AT_type        : <0x94>
    <7b5>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><7b8>: Abbrev Number: 7 (DW_TAG_variable)
    <7b9>   DW_AT_name        : (indirect string, offset: 0x1209e): read
    <7bd>   DW_AT_decl_file   : 1
    <7bd>   DW_AT_decl_line   : 530
    <7bf>   DW_AT_decl_column : 13
    <7c0>   DW_AT_type        : <0x94>
    <7c4>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><7c7>: Abbrev Number: 0
 <1><7c8>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <7c9>   DW_AT_byte_size   : 4
    <7c9>   DW_AT_type        : <0x6e0>
 <1><7cd>: Abbrev Number: 16 (DW_TAG_subprogram)
    <7ce>   DW_AT_external    : 1
    <7ce>   DW_AT_name        : (indirect string, offset: 0x456da): LoRa_getRSSI
    <7d2>   DW_AT_decl_file   : 1
    <7d2>   DW_AT_decl_line   : 512
    <7d4>   DW_AT_decl_column : 5
    <7d5>   DW_AT_prototyped  : 1
    <7d5>   DW_AT_type        : <0x86>
    <7d9>   DW_AT_low_pc      : 0
    <7dd>   DW_AT_high_pc     : 0x20
    <7e1>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7e3>   DW_AT_call_all_tail_calls: 1
    <7e3>   DW_AT_sibling     : <0x806>
 <2><7e7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7e8>   DW_AT_name        : (indirect string, offset: 0x64cd0): _LoRa
    <7ec>   DW_AT_decl_file   : 1
    <7ec>   DW_AT_decl_line   : 512
    <7ee>   DW_AT_decl_column : 24
    <7ef>   DW_AT_type        : <0x7c8>
    <7f3>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><7f6>: Abbrev Number: 7 (DW_TAG_variable)
    <7f7>   DW_AT_name        : (indirect string, offset: 0x1209e): read
    <7fb>   DW_AT_decl_file   : 1
    <7fb>   DW_AT_decl_line   : 513
    <7fd>   DW_AT_decl_column : 10
    <7fe>   DW_AT_type        : <0x94>
    <802>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><805>: Abbrev Number: 0
 <1><806>: Abbrev Number: 16 (DW_TAG_subprogram)
    <807>   DW_AT_external    : 1
    <807>   DW_AT_name        : (indirect string, offset: 0x608ad): LoRa_receive
    <80b>   DW_AT_decl_file   : 1
    <80b>   DW_AT_decl_line   : 479
    <80d>   DW_AT_decl_column : 9
    <80e>   DW_AT_prototyped  : 1
    <80e>   DW_AT_type        : <0x94>
    <812>   DW_AT_low_pc      : 0x8001270
    <816>   DW_AT_high_pc     : 0xc0
    <81a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <81c>   DW_AT_call_all_tail_calls: 1
    <81c>   DW_AT_sibling     : <0x8ad>
 <2><820>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <821>   DW_AT_name        : (indirect string, offset: 0x64cd0): _LoRa
    <825>   DW_AT_decl_file   : 1
    <825>   DW_AT_decl_line   : 479
    <827>   DW_AT_decl_column : 28
    <828>   DW_AT_type        : <0x7c8>
    <82c>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><82f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <830>   DW_AT_name        : (indirect string, offset: 0x6b2e7): data
    <834>   DW_AT_decl_file   : 1
    <834>   DW_AT_decl_line   : 479
    <836>   DW_AT_decl_column : 44
    <837>   DW_AT_type        : <0x5d6>
    <83b>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><83e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <83f>   DW_AT_name        : (indirect string, offset: 0x4254a): length
    <843>   DW_AT_decl_file   : 1
    <843>   DW_AT_decl_line   : 479
    <845>   DW_AT_decl_column : 58
    <846>   DW_AT_type        : <0x94>
    <84a>   DW_AT_location    : 2 byte block: 91 57 	(DW_OP_fbreg: -41)
 <2><84d>: Abbrev Number: 7 (DW_TAG_variable)
    <84e>   DW_AT_name        : (indirect string, offset: 0x1209e): read
    <852>   DW_AT_decl_file   : 1
    <852>   DW_AT_decl_line   : 480
    <854>   DW_AT_decl_column : 10
    <855>   DW_AT_type        : <0x94>
    <859>   DW_AT_location    : 2 byte block: 91 63 	(DW_OP_fbreg: -29)
 <2><85c>: Abbrev Number: 7 (DW_TAG_variable)
    <85d>   DW_AT_name        : (indirect string, offset: 0x5c29e): number_of_bytes
    <861>   DW_AT_decl_file   : 1
    <861>   DW_AT_decl_line   : 481
    <863>   DW_AT_decl_column : 10
    <864>   DW_AT_type        : <0x94>
    <868>   DW_AT_location    : 2 byte block: 91 62 	(DW_OP_fbreg: -30)
 <2><86b>: Abbrev Number: 22 (DW_TAG_variable)
    <86c>   DW_AT_name        : min
    <870>   DW_AT_decl_file   : 1
    <870>   DW_AT_decl_line   : 482
    <872>   DW_AT_decl_column : 10
    <873>   DW_AT_type        : <0x94>
    <877>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><87a>: Abbrev Number: 33 (DW_TAG_lexical_block)
    <87b>   DW_AT_low_pc      : 0x8001282
    <87f>   DW_AT_high_pc     : 0x1e
    <883>   DW_AT_sibling     : <0x895>
 <3><887>: Abbrev Number: 22 (DW_TAG_variable)
    <888>   DW_AT_name        : i
    <88a>   DW_AT_decl_file   : 1
    <88a>   DW_AT_decl_line   : 484
    <88c>   DW_AT_decl_column : 10
    <88d>   DW_AT_type        : <0x86>
    <891>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <3><894>: Abbrev Number: 0
 <2><895>: Abbrev Number: 34 (DW_TAG_lexical_block)
    <896>   DW_AT_low_pc      : 0x80012f8
    <89a>   DW_AT_high_pc     : 0x26
 <3><89e>: Abbrev Number: 22 (DW_TAG_variable)
    <89f>   DW_AT_name        : i
    <8a1>   DW_AT_decl_file   : 1
    <8a1>   DW_AT_decl_line   : 495
    <8a3>   DW_AT_decl_column : 11
    <8a4>   DW_AT_type        : <0x86>
    <8a8>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <3><8ab>: Abbrev Number: 0
 <2><8ac>: Abbrev Number: 0
 <1><8ad>: Abbrev Number: 14 (DW_TAG_subprogram)
    <8ae>   DW_AT_external    : 1
    <8ae>   DW_AT_name        : (indirect string, offset: 0x7b43a): LoRa_startReceiving
    <8b2>   DW_AT_decl_file   : 1
    <8b2>   DW_AT_decl_line   : 463
    <8b4>   DW_AT_decl_column : 6
    <8b4>   DW_AT_prototyped  : 1
    <8b4>   DW_AT_low_pc      : 0x8001258
    <8b8>   DW_AT_high_pc     : 0x18
    <8bc>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8be>   DW_AT_call_all_tail_calls: 1
    <8be>   DW_AT_sibling     : <0x8d2>
 <2><8c2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8c3>   DW_AT_name        : (indirect string, offset: 0x64cd0): _LoRa
    <8c7>   DW_AT_decl_file   : 1
    <8c7>   DW_AT_decl_line   : 463
    <8c9>   DW_AT_decl_column : 32
    <8ca>   DW_AT_type        : <0x7c8>
    <8ce>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><8d1>: Abbrev Number: 0
 <1><8d2>: Abbrev Number: 16 (DW_TAG_subprogram)
    <8d3>   DW_AT_external    : 1
    <8d3>   DW_AT_name        : (indirect string, offset: 0x3fc53): LoRa_transmit
    <8d7>   DW_AT_decl_file   : 1
    <8d7>   DW_AT_decl_line   : 426
    <8d9>   DW_AT_decl_column : 9
    <8da>   DW_AT_prototyped  : 1
    <8da>   DW_AT_type        : <0x94>
    <8de>   DW_AT_low_pc      : 0x80011a8
    <8e2>   DW_AT_high_pc     : 0xb0
    <8e6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8e8>   DW_AT_call_all_tail_calls: 1
    <8e8>   DW_AT_sibling     : <0x947>
 <2><8ec>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8ed>   DW_AT_name        : (indirect string, offset: 0x64cd0): _LoRa
    <8f1>   DW_AT_decl_file   : 1
    <8f1>   DW_AT_decl_line   : 426
    <8f3>   DW_AT_decl_column : 29
    <8f4>   DW_AT_type        : <0x7c8>
    <8f8>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><8fb>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8fc>   DW_AT_name        : (indirect string, offset: 0x6b2e7): data
    <900>   DW_AT_decl_file   : 1
    <900>   DW_AT_decl_line   : 426
    <902>   DW_AT_decl_column : 45
    <903>   DW_AT_type        : <0x5d6>
    <907>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><90a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <90b>   DW_AT_name        : (indirect string, offset: 0x4254a): length
    <90f>   DW_AT_decl_file   : 1
    <90f>   DW_AT_decl_line   : 426
    <911>   DW_AT_decl_column : 59
    <912>   DW_AT_type        : <0x94>
    <916>   DW_AT_location    : 2 byte block: 91 67 	(DW_OP_fbreg: -25)
 <2><919>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <91a>   DW_AT_name        : (indirect string, offset: 0x835ca): timeout
    <91e>   DW_AT_decl_file   : 1
    <91e>   DW_AT_decl_line   : 426
    <920>   DW_AT_decl_column : 76
    <921>   DW_AT_type        : <0xa5>
    <925>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><928>: Abbrev Number: 7 (DW_TAG_variable)
    <929>   DW_AT_name        : (indirect string, offset: 0x1209e): read
    <92d>   DW_AT_decl_file   : 1
    <92d>   DW_AT_decl_line   : 427
    <92f>   DW_AT_decl_column : 10
    <930>   DW_AT_type        : <0x94>
    <934>   DW_AT_location    : 2 byte block: 91 73 	(DW_OP_fbreg: -13)
 <2><937>: Abbrev Number: 7 (DW_TAG_variable)
    <938>   DW_AT_name        : (indirect string, offset: 0x838ba): mode
    <93c>   DW_AT_decl_file   : 1
    <93c>   DW_AT_decl_line   : 429
    <93e>   DW_AT_decl_column : 6
    <93f>   DW_AT_type        : <0x86>
    <943>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><946>: Abbrev Number: 0
 <1><947>: Abbrev Number: 35 (DW_TAG_subprogram)
    <948>   DW_AT_external    : 1
    <948>   DW_AT_name        : (indirect string, offset: 0x36747): LoRa_isvalid
    <94c>   DW_AT_decl_file   : 1
    <94d>   DW_AT_decl_line   : 409
    <94f>   DW_AT_decl_column : 9
    <950>   DW_AT_prototyped  : 1
    <950>   DW_AT_type        : <0x94>
    <954>   DW_AT_low_pc      : 0x8001194
    <958>   DW_AT_high_pc     : 0x14
    <95c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <95e>   DW_AT_call_all_calls: 1
    <95e>   DW_AT_sibling     : <0x972>
 <2><962>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <963>   DW_AT_name        : (indirect string, offset: 0x64cd0): _LoRa
    <967>   DW_AT_decl_file   : 1
    <967>   DW_AT_decl_line   : 409
    <969>   DW_AT_decl_column : 28
    <96a>   DW_AT_type        : <0x7c8>
    <96e>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><971>: Abbrev Number: 0
 <1><972>: Abbrev Number: 14 (DW_TAG_subprogram)
    <973>   DW_AT_external    : 1
    <973>   DW_AT_name        : (indirect string, offset: 0x5f0e7): LoRa_BurstWrite
    <977>   DW_AT_decl_file   : 1
    <977>   DW_AT_decl_line   : 381
    <979>   DW_AT_decl_column : 6
    <979>   DW_AT_prototyped  : 1
    <979>   DW_AT_low_pc      : 0x8001106
    <97d>   DW_AT_high_pc     : 0x8e
    <981>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <983>   DW_AT_call_all_tail_calls: 1
    <983>   DW_AT_sibling     : <0x9d3>
 <2><987>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <988>   DW_AT_name        : (indirect string, offset: 0x64cd0): _LoRa
    <98c>   DW_AT_decl_file   : 1
    <98c>   DW_AT_decl_line   : 381
    <98e>   DW_AT_decl_column : 28
    <98f>   DW_AT_type        : <0x7c8>
    <993>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><996>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <997>   DW_AT_name        : (indirect string, offset: 0x4372): address
    <99b>   DW_AT_decl_file   : 1
    <99b>   DW_AT_decl_line   : 381
    <99d>   DW_AT_decl_column : 43
    <99e>   DW_AT_type        : <0x94>
    <9a2>   DW_AT_location    : 2 byte block: 91 6b 	(DW_OP_fbreg: -21)
 <2><9a5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9a6>   DW_AT_name        : (indirect string, offset: 0x82e57): value
    <9aa>   DW_AT_decl_file   : 1
    <9aa>   DW_AT_decl_line   : 381
    <9ac>   DW_AT_decl_column : 61
    <9ad>   DW_AT_type        : <0x5d6>
    <9b1>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><9b4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9b5>   DW_AT_name        : (indirect string, offset: 0x4254a): length
    <9b9>   DW_AT_decl_file   : 1
    <9b9>   DW_AT_decl_line   : 381
    <9bb>   DW_AT_decl_column : 76
    <9bc>   DW_AT_type        : <0x94>
    <9c0>   DW_AT_location    : 2 byte block: 91 6a 	(DW_OP_fbreg: -22)
 <2><9c3>: Abbrev Number: 7 (DW_TAG_variable)
    <9c4>   DW_AT_name        : (indirect string, offset: 0x73f6e): addr
    <9c8>   DW_AT_decl_file   : 1
    <9c8>   DW_AT_decl_line   : 382
    <9ca>   DW_AT_decl_column : 10
    <9cb>   DW_AT_type        : <0x94>
    <9cf>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><9d2>: Abbrev Number: 0
 <1><9d3>: Abbrev Number: 14 (DW_TAG_subprogram)
    <9d4>   DW_AT_external    : 1
    <9d4>   DW_AT_name        : (indirect string, offset: 0x2a412): LoRa_write
    <9d8>   DW_AT_decl_file   : 1
    <9d8>   DW_AT_decl_line   : 359
    <9da>   DW_AT_decl_column : 6
    <9da>   DW_AT_prototyped  : 1
    <9da>   DW_AT_low_pc      : 0x80010cc
    <9de>   DW_AT_high_pc     : 0x3a
    <9e2>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9e4>   DW_AT_call_all_tail_calls: 1
    <9e4>   DW_AT_sibling     : <0xa34>
 <2><9e8>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9e9>   DW_AT_name        : (indirect string, offset: 0x64cd0): _LoRa
    <9ed>   DW_AT_decl_file   : 1
    <9ed>   DW_AT_decl_line   : 359
    <9ef>   DW_AT_decl_column : 23
    <9f0>   DW_AT_type        : <0x7c8>
    <9f4>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><9f7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9f8>   DW_AT_name        : (indirect string, offset: 0x4372): address
    <9fc>   DW_AT_decl_file   : 1
    <9fc>   DW_AT_decl_line   : 359
    <9fe>   DW_AT_decl_column : 38
    <9ff>   DW_AT_type        : <0x94>
    <a03>   DW_AT_location    : 2 byte block: 91 6b 	(DW_OP_fbreg: -21)
 <2><a06>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a07>   DW_AT_name        : (indirect string, offset: 0x82e57): value
    <a0b>   DW_AT_decl_file   : 1
    <a0b>   DW_AT_decl_line   : 359
    <a0d>   DW_AT_decl_column : 55
    <a0e>   DW_AT_type        : <0x94>
    <a12>   DW_AT_location    : 2 byte block: 91 6a 	(DW_OP_fbreg: -22)
 <2><a15>: Abbrev Number: 7 (DW_TAG_variable)
    <a16>   DW_AT_name        : (indirect string, offset: 0x6b2e7): data
    <a1a>   DW_AT_decl_file   : 1
    <a1a>   DW_AT_decl_line   : 360
    <a1c>   DW_AT_decl_column : 10
    <a1d>   DW_AT_type        : <0x94>
    <a21>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><a24>: Abbrev Number: 7 (DW_TAG_variable)
    <a25>   DW_AT_name        : (indirect string, offset: 0x73f6e): addr
    <a29>   DW_AT_decl_file   : 1
    <a29>   DW_AT_decl_line   : 361
    <a2b>   DW_AT_decl_column : 10
    <a2c>   DW_AT_type        : <0x94>
    <a30>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><a33>: Abbrev Number: 0
 <1><a34>: Abbrev Number: 16 (DW_TAG_subprogram)
    <a35>   DW_AT_external    : 1
    <a35>   DW_AT_name        : (indirect string, offset: 0x12099): LoRa_read
    <a39>   DW_AT_decl_file   : 1
    <a39>   DW_AT_decl_line   : 336
    <a3b>   DW_AT_decl_column : 9
    <a3c>   DW_AT_prototyped  : 1
    <a3c>   DW_AT_type        : <0x94>
    <a40>   DW_AT_low_pc      : 0x8001098
    <a44>   DW_AT_high_pc     : 0x34
    <a48>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a4a>   DW_AT_call_all_tail_calls: 1
    <a4a>   DW_AT_sibling     : <0xa8b>
 <2><a4e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a4f>   DW_AT_name        : (indirect string, offset: 0x64cd0): _LoRa
    <a53>   DW_AT_decl_file   : 1
    <a53>   DW_AT_decl_line   : 336
    <a55>   DW_AT_decl_column : 25
    <a56>   DW_AT_type        : <0x7c8>
    <a5a>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><a5d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a5e>   DW_AT_name        : (indirect string, offset: 0x4372): address
    <a62>   DW_AT_decl_file   : 1
    <a62>   DW_AT_decl_line   : 336
    <a64>   DW_AT_decl_column : 40
    <a65>   DW_AT_type        : <0x94>
    <a69>   DW_AT_location    : 2 byte block: 91 6b 	(DW_OP_fbreg: -21)
 <2><a6c>: Abbrev Number: 7 (DW_TAG_variable)
    <a6d>   DW_AT_name        : (indirect string, offset: 0x6b2e2): read_data
    <a71>   DW_AT_decl_file   : 1
    <a71>   DW_AT_decl_line   : 337
    <a73>   DW_AT_decl_column : 10
    <a74>   DW_AT_type        : <0x94>
    <a78>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><a7b>: Abbrev Number: 7 (DW_TAG_variable)
    <a7c>   DW_AT_name        : (indirect string, offset: 0x73f69): data_addr
    <a80>   DW_AT_decl_file   : 1
    <a80>   DW_AT_decl_line   : 338
    <a82>   DW_AT_decl_column : 10
    <a83>   DW_AT_type        : <0x94>
    <a87>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><a8a>: Abbrev Number: 0
 <1><a8b>: Abbrev Number: 14 (DW_TAG_subprogram)
    <a8c>   DW_AT_external    : 1
    <a8c>   DW_AT_name        : (indirect string, offset: 0xf8ad): LoRa_setSyncWord
    <a90>   DW_AT_decl_file   : 1
    <a90>   DW_AT_decl_line   : 320
    <a92>   DW_AT_decl_column : 6
    <a92>   DW_AT_prototyped  : 1
    <a92>   DW_AT_low_pc      : 0x8001072
    <a96>   DW_AT_high_pc     : 0x26
    <a9a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a9c>   DW_AT_call_all_tail_calls: 1
    <a9c>   DW_AT_sibling     : <0xabf>
 <2><aa0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <aa1>   DW_AT_name        : (indirect string, offset: 0x64cd0): _LoRa
    <aa5>   DW_AT_decl_file   : 1
    <aa5>   DW_AT_decl_line   : 320
    <aa7>   DW_AT_decl_column : 29
    <aa8>   DW_AT_type        : <0x7c8>
    <aac>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><aaf>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <ab0>   DW_AT_name        : (indirect string, offset: 0x2e5bf): syncword
    <ab4>   DW_AT_decl_file   : 1
    <ab4>   DW_AT_decl_line   : 320
    <ab6>   DW_AT_decl_column : 44
    <ab7>   DW_AT_type        : <0x94>
    <abb>   DW_AT_location    : 2 byte block: 91 73 	(DW_OP_fbreg: -13)
 <2><abe>: Abbrev Number: 0
 <1><abf>: Abbrev Number: 14 (DW_TAG_subprogram)
    <ac0>   DW_AT_external    : 1
    <ac0>   DW_AT_name        : (indirect string, offset: 0x22476): LoRa_setTOMsb_setCRCon
    <ac4>   DW_AT_decl_file   : 1
    <ac4>   DW_AT_decl_line   : 300
    <ac6>   DW_AT_decl_column : 6
    <ac6>   DW_AT_prototyped  : 1
    <ac6>   DW_AT_low_pc      : 0x800103c
    <aca>   DW_AT_high_pc     : 0x36
    <ace>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ad0>   DW_AT_call_all_tail_calls: 1
    <ad0>   DW_AT_sibling     : <0xb02>
 <2><ad4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <ad5>   DW_AT_name        : (indirect string, offset: 0x64cd0): _LoRa
    <ad9>   DW_AT_decl_file   : 1
    <ad9>   DW_AT_decl_line   : 300
    <adb>   DW_AT_decl_column : 35
    <adc>   DW_AT_type        : <0x7c8>
    <ae0>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><ae3>: Abbrev Number: 7 (DW_TAG_variable)
    <ae4>   DW_AT_name        : (indirect string, offset: 0x1209e): read
    <ae8>   DW_AT_decl_file   : 1
    <ae8>   DW_AT_decl_line   : 301
    <aea>   DW_AT_decl_column : 10
    <aeb>   DW_AT_type        : <0x94>
    <aef>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><af2>: Abbrev Number: 7 (DW_TAG_variable)
    <af3>   DW_AT_name        : (indirect string, offset: 0x6b2e7): data
    <af7>   DW_AT_decl_file   : 1
    <af7>   DW_AT_decl_line   : 301
    <af9>   DW_AT_decl_column : 16
    <afa>   DW_AT_type        : <0x94>
    <afe>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><b01>: Abbrev Number: 0
 <1><b02>: Abbrev Number: 14 (DW_TAG_subprogram)
    <b03>   DW_AT_external    : 1
    <b03>   DW_AT_name        : (indirect string, offset: 0x75f84): LoRa_setOCP
    <b07>   DW_AT_decl_file   : 1
    <b07>   DW_AT_decl_line   : 272
    <b09>   DW_AT_decl_column : 6
    <b09>   DW_AT_prototyped  : 1
    <b09>   DW_AT_low_pc      : 0x8000fc0
    <b0d>   DW_AT_high_pc     : 0x7c
    <b11>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b13>   DW_AT_call_all_tail_calls: 1
    <b13>   DW_AT_sibling     : <0xb45>
 <2><b17>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <b18>   DW_AT_name        : (indirect string, offset: 0x64cd0): _LoRa
    <b1c>   DW_AT_decl_file   : 1
    <b1c>   DW_AT_decl_line   : 272
    <b1e>   DW_AT_decl_column : 24
    <b1f>   DW_AT_type        : <0x7c8>
    <b23>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><b26>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <b27>   DW_AT_name        : (indirect string, offset: 0x83270): current
    <b2b>   DW_AT_decl_file   : 1
    <b2b>   DW_AT_decl_line   : 272
    <b2d>   DW_AT_decl_column : 39
    <b2e>   DW_AT_type        : <0x94>
    <b32>   DW_AT_location    : 2 byte block: 91 6b 	(DW_OP_fbreg: -21)
 <2><b35>: Abbrev Number: 7 (DW_TAG_variable)
    <b36>   DW_AT_name        : (indirect string, offset: 0x12357): OcpTrim
    <b3a>   DW_AT_decl_file   : 1
    <b3a>   DW_AT_decl_line   : 273
    <b3c>   DW_AT_decl_column : 10
    <b3d>   DW_AT_type        : <0x94>
    <b41>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><b44>: Abbrev Number: 0
 <1><b45>: Abbrev Number: 14 (DW_TAG_subprogram)
    <b46>   DW_AT_external    : 1
    <b46>   DW_AT_name        : (indirect string, offset: 0x3a54f): LoRa_setPower
    <b4a>   DW_AT_decl_file   : 1
    <b4a>   DW_AT_decl_line   : 256
    <b4c>   DW_AT_decl_column : 6
    <b4c>   DW_AT_prototyped  : 1
    <b4c>   DW_AT_low_pc      : 0x8000f98
    <b50>   DW_AT_high_pc     : 0x26
    <b54>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b56>   DW_AT_call_all_tail_calls: 1
    <b56>   DW_AT_sibling     : <0xb79>
 <2><b5a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <b5b>   DW_AT_name        : (indirect string, offset: 0x64cd0): _LoRa
    <b5f>   DW_AT_decl_file   : 1
    <b5f>   DW_AT_decl_line   : 256
    <b61>   DW_AT_decl_column : 26
    <b62>   DW_AT_type        : <0x7c8>
    <b66>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><b69>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <b6a>   DW_AT_name        : (indirect string, offset: 0x13a4c): power
    <b6e>   DW_AT_decl_file   : 1
    <b6e>   DW_AT_decl_line   : 256
    <b70>   DW_AT_decl_column : 41
    <b71>   DW_AT_type        : <0x94>
    <b75>   DW_AT_location    : 2 byte block: 91 73 	(DW_OP_fbreg: -13)
 <2><b78>: Abbrev Number: 0
 <1><b79>: Abbrev Number: 12 (DW_TAG_subprogram)
    <b7a>   DW_AT_external    : 1
    <b7a>   DW_AT_name        : (indirect string, offset: 0x413dc): LoRa_setSpreadingFactor
    <b7e>   DW_AT_decl_file   : 1
    <b7e>   DW_AT_decl_line   : 226
    <b7f>   DW_AT_decl_column : 6
    <b7f>   DW_AT_prototyped  : 1
    <b7f>   DW_AT_low_pc      : 0x8000f34
    <b83>   DW_AT_high_pc     : 0x64
    <b87>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b89>   DW_AT_call_all_tail_calls: 1
    <b89>   DW_AT_sibling     : <0xbc6>
 <2><b8d>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <b8e>   DW_AT_name        : (indirect string, offset: 0x64cd0): _LoRa
    <b92>   DW_AT_decl_file   : 1
    <b92>   DW_AT_decl_line   : 226
    <b93>   DW_AT_decl_column : 36
    <b94>   DW_AT_type        : <0x7c8>
    <b98>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><b9b>: Abbrev Number: 36 (DW_TAG_formal_parameter)
    <b9c>   DW_AT_name        : SF
    <b9f>   DW_AT_decl_file   : 1
    <ba0>   DW_AT_decl_line   : 226
    <ba1>   DW_AT_decl_column : 47
    <ba2>   DW_AT_type        : <0x86>
    <ba6>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><ba9>: Abbrev Number: 13 (DW_TAG_variable)
    <baa>   DW_AT_name        : (indirect string, offset: 0x6b2e7): data
    <bae>   DW_AT_decl_file   : 1
    <bae>   DW_AT_decl_line   : 227
    <baf>   DW_AT_decl_column : 10
    <bb0>   DW_AT_type        : <0x94>
    <bb4>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><bb7>: Abbrev Number: 13 (DW_TAG_variable)
    <bb8>   DW_AT_name        : (indirect string, offset: 0x1209e): read
    <bbc>   DW_AT_decl_file   : 1
    <bbc>   DW_AT_decl_line   : 228
    <bbd>   DW_AT_decl_column : 10
    <bbe>   DW_AT_type        : <0x94>
    <bc2>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><bc5>: Abbrev Number: 0
 <1><bc6>: Abbrev Number: 12 (DW_TAG_subprogram)
    <bc7>   DW_AT_external    : 1
    <bc7>   DW_AT_name        : (indirect string, offset: 0x6ccb2): LoRa_setFrequency
    <bcb>   DW_AT_decl_file   : 1
    <bcb>   DW_AT_decl_line   : 194
    <bcc>   DW_AT_decl_column : 6
    <bcc>   DW_AT_prototyped  : 1
    <bcc>   DW_AT_low_pc      : 0x8000ed4
    <bd0>   DW_AT_high_pc     : 0x60
    <bd4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <bd6>   DW_AT_call_all_tail_calls: 1
    <bd6>   DW_AT_sibling     : <0xc11>
 <2><bda>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <bdb>   DW_AT_name        : (indirect string, offset: 0x64cd0): _LoRa
    <bdf>   DW_AT_decl_file   : 1
    <bdf>   DW_AT_decl_line   : 194
    <be0>   DW_AT_decl_column : 30
    <be1>   DW_AT_type        : <0x7c8>
    <be5>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><be8>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <be9>   DW_AT_name        : (indirect string, offset: 0x834a1): freq
    <bed>   DW_AT_decl_file   : 1
    <bed>   DW_AT_decl_line   : 194
    <bee>   DW_AT_decl_column : 41
    <bef>   DW_AT_type        : <0x86>
    <bf3>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><bf6>: Abbrev Number: 13 (DW_TAG_variable)
    <bf7>   DW_AT_name        : (indirect string, offset: 0x6b2e7): data
    <bfb>   DW_AT_decl_file   : 1
    <bfb>   DW_AT_decl_line   : 195
    <bfc>   DW_AT_decl_column : 11
    <bfd>   DW_AT_type        : <0x94>
    <c01>   DW_AT_location    : 2 byte block: 91 73 	(DW_OP_fbreg: -13)
 <2><c04>: Abbrev Number: 26 (DW_TAG_variable)
    <c05>   DW_AT_name        : F
    <c07>   DW_AT_decl_file   : 1
    <c07>   DW_AT_decl_line   : 196
    <c08>   DW_AT_decl_column : 11
    <c09>   DW_AT_type        : <0xb6>
    <c0d>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><c10>: Abbrev Number: 0
 <1><c11>: Abbrev Number: 12 (DW_TAG_subprogram)
    <c12>   DW_AT_external    : 1
    <c12>   DW_AT_name        : (indirect string, offset: 0x2ddaa): LoRa_setAutoLDO
    <c16>   DW_AT_decl_file   : 1
    <c16>   DW_AT_decl_line   : 177
    <c17>   DW_AT_decl_column : 6
    <c17>   DW_AT_prototyped  : 1
    <c17>   DW_AT_low_pc      : 0x8000e68
    <c1b>   DW_AT_high_pc     : 0x6c
    <c1f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c21>   DW_AT_call_all_tail_calls: 1
    <c21>   DW_AT_sibling     : <0xc43>
 <2><c25>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <c26>   DW_AT_name        : (indirect string, offset: 0x64cd0): _LoRa
    <c2a>   DW_AT_decl_file   : 1
    <c2a>   DW_AT_decl_line   : 177
    <c2b>   DW_AT_decl_column : 28
    <c2c>   DW_AT_type        : <0x7c8>
    <c30>   DW_AT_location    : 3 byte block: 91 a4 7f 	(DW_OP_fbreg: -92)
 <2><c34>: Abbrev Number: 26 (DW_TAG_variable)
    <c35>   DW_AT_name        : BW
    <c38>   DW_AT_decl_file   : 1
    <c38>   DW_AT_decl_line   : 178
    <c39>   DW_AT_decl_column : 9
    <c3a>   DW_AT_type        : <0xc43>
    <c3e>   DW_AT_location    : 3 byte block: 91 a8 7f 	(DW_OP_fbreg: -88)
 <2><c42>: Abbrev Number: 0
 <1><c43>: Abbrev Number: 37 (DW_TAG_array_type)
    <c44>   DW_AT_type        : <0xc53>
    <c48>   DW_AT_sibling     : <0xc53>
 <2><c4c>: Abbrev Number: 38 (DW_TAG_subrange_type)
    <c4d>   DW_AT_type        : <0x8d>
    <c51>   DW_AT_upper_bound : 9
 <2><c52>: Abbrev Number: 0
 <1><c53>: Abbrev Number: 9 (DW_TAG_base_type)
    <c54>   DW_AT_byte_size   : 8
    <c55>   DW_AT_encoding    : 4	(float)
    <c56>   DW_AT_name        : (indirect string, offset: 0x7cf97): double
 <1><c5a>: Abbrev Number: 12 (DW_TAG_subprogram)
    <c5b>   DW_AT_external    : 1
    <c5b>   DW_AT_name        : (indirect string, offset: 0x1ec98): LoRa_setLowDaraRateOptimization
    <c5f>   DW_AT_decl_file   : 1
    <c5f>   DW_AT_decl_line   : 152
    <c60>   DW_AT_decl_column : 6
    <c60>   DW_AT_prototyped  : 1
    <c60>   DW_AT_low_pc      : 0x8000e1c
    <c64>   DW_AT_high_pc     : 0x4a
    <c68>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c6a>   DW_AT_call_all_tail_calls: 1
    <c6a>   DW_AT_sibling     : <0xca7>
 <2><c6e>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <c6f>   DW_AT_name        : (indirect string, offset: 0x64cd0): _LoRa
    <c73>   DW_AT_decl_file   : 1
    <c73>   DW_AT_decl_line   : 152
    <c74>   DW_AT_decl_column : 44
    <c75>   DW_AT_type        : <0x7c8>
    <c79>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><c7c>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <c7d>   DW_AT_name        : (indirect string, offset: 0x82e57): value
    <c81>   DW_AT_decl_file   : 1
    <c81>   DW_AT_decl_line   : 152
    <c82>   DW_AT_decl_column : 59
    <c83>   DW_AT_type        : <0x94>
    <c87>   DW_AT_location    : 2 byte block: 91 6b 	(DW_OP_fbreg: -21)
 <2><c8a>: Abbrev Number: 13 (DW_TAG_variable)
    <c8b>   DW_AT_name        : (indirect string, offset: 0x6b2e7): data
    <c8f>   DW_AT_decl_file   : 1
    <c8f>   DW_AT_decl_line   : 153
    <c90>   DW_AT_decl_column : 10
    <c91>   DW_AT_type        : <0x94>
    <c95>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><c98>: Abbrev Number: 13 (DW_TAG_variable)
    <c99>   DW_AT_name        : (indirect string, offset: 0x1209e): read
    <c9d>   DW_AT_decl_file   : 1
    <c9d>   DW_AT_decl_line   : 154
    <c9e>   DW_AT_decl_column : 10
    <c9f>   DW_AT_type        : <0x94>
    <ca3>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><ca6>: Abbrev Number: 0
 <1><ca7>: Abbrev Number: 12 (DW_TAG_subprogram)
    <ca8>   DW_AT_external    : 1
    <ca8>   DW_AT_name        : (indirect string, offset: 0x4aef6): LoRa_writeReg
    <cac>   DW_AT_decl_file   : 1
    <cac>   DW_AT_decl_line   : 130
    <cad>   DW_AT_decl_column : 6
    <cad>   DW_AT_prototyped  : 1
    <cad>   DW_AT_low_pc      : 0x8000da0
    <cb1>   DW_AT_high_pc     : 0x7c
    <cb5>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <cb7>   DW_AT_call_all_tail_calls: 1
    <cb7>   DW_AT_sibling     : <0xd02>
 <2><cbb>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <cbc>   DW_AT_name        : (indirect string, offset: 0x64cd0): _LoRa
    <cc0>   DW_AT_decl_file   : 1
    <cc0>   DW_AT_decl_line   : 130
    <cc1>   DW_AT_decl_column : 26
    <cc2>   DW_AT_type        : <0x7c8>
    <cc6>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><cc9>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <cca>   DW_AT_name        : (indirect string, offset: 0x4372): address
    <cce>   DW_AT_decl_file   : 1
    <cce>   DW_AT_decl_line   : 130
    <ccf>   DW_AT_decl_column : 42
    <cd0>   DW_AT_type        : <0x5d6>
    <cd4>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><cd7>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <cd8>   DW_AT_name        : (indirect string, offset: 0x42548): r_length
    <cdc>   DW_AT_decl_file   : 1
    <cdc>   DW_AT_decl_line   : 130
    <cdd>   DW_AT_decl_column : 60
    <cde>   DW_AT_type        : <0xa5>
    <ce2>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><ce5>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <ce6>   DW_AT_name        : (indirect string, offset: 0x2f811): values
    <cea>   DW_AT_decl_file   : 1
    <cea>   DW_AT_decl_line   : 130
    <ceb>   DW_AT_decl_column : 79
    <cec>   DW_AT_type        : <0x5d6>
    <cf0>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><cf3>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <cf4>   DW_AT_name        : (indirect string, offset: 0x3a6c3): w_length
    <cf8>   DW_AT_decl_file   : 1
    <cf8>   DW_AT_decl_line   : 130
    <cf9>   DW_AT_decl_column : 96
    <cfa>   DW_AT_type        : <0xa5>
    <cfe>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><d01>: Abbrev Number: 0
 <1><d02>: Abbrev Number: 12 (DW_TAG_subprogram)
    <d03>   DW_AT_external    : 1
    <d03>   DW_AT_name        : (indirect string, offset: 0x26f31): LoRa_readReg
    <d07>   DW_AT_decl_file   : 1
    <d07>   DW_AT_decl_line   : 104
    <d08>   DW_AT_decl_column : 6
    <d08>   DW_AT_prototyped  : 1
    <d08>   DW_AT_low_pc      : 0x8000d24
    <d0c>   DW_AT_high_pc     : 0x7c
    <d10>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d12>   DW_AT_call_all_tail_calls: 1
    <d12>   DW_AT_sibling     : <0xd5d>
 <2><d16>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <d17>   DW_AT_name        : (indirect string, offset: 0x64cd0): _LoRa
    <d1b>   DW_AT_decl_file   : 1
    <d1b>   DW_AT_decl_line   : 104
    <d1c>   DW_AT_decl_column : 25
    <d1d>   DW_AT_type        : <0x7c8>
    <d21>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><d24>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <d25>   DW_AT_name        : (indirect string, offset: 0x4372): address
    <d29>   DW_AT_decl_file   : 1
    <d29>   DW_AT_decl_line   : 104
    <d2a>   DW_AT_decl_column : 41
    <d2b>   DW_AT_type        : <0x5d6>
    <d2f>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><d32>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <d33>   DW_AT_name        : (indirect string, offset: 0x42548): r_length
    <d37>   DW_AT_decl_file   : 1
    <d37>   DW_AT_decl_line   : 104
    <d38>   DW_AT_decl_column : 59
    <d39>   DW_AT_type        : <0xa5>
    <d3d>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><d40>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <d41>   DW_AT_name        : (indirect string, offset: 0x692ab): output
    <d45>   DW_AT_decl_file   : 1
    <d45>   DW_AT_decl_line   : 104
    <d46>   DW_AT_decl_column : 78
    <d47>   DW_AT_type        : <0x5d6>
    <d4b>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><d4e>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <d4f>   DW_AT_name        : (indirect string, offset: 0x3a6c3): w_length
    <d53>   DW_AT_decl_file   : 1
    <d53>   DW_AT_decl_line   : 104
    <d54>   DW_AT_decl_column : 95
    <d55>   DW_AT_type        : <0xa5>
    <d59>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><d5c>: Abbrev Number: 0
 <1><d5d>: Abbrev Number: 12 (DW_TAG_subprogram)
    <d5e>   DW_AT_external    : 1
    <d5e>   DW_AT_name        : (indirect string, offset: 0x37aa9): LoRa_gotoMode
    <d62>   DW_AT_decl_file   : 1
    <d62>   DW_AT_decl_line   : 60
    <d63>   DW_AT_decl_column : 6
    <d63>   DW_AT_prototyped  : 1
    <d63>   DW_AT_low_pc      : 0x8000c62
    <d67>   DW_AT_high_pc     : 0xc2
    <d6b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d6d>   DW_AT_call_all_tail_calls: 1
    <d6d>   DW_AT_sibling     : <0xdaa>
 <2><d71>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <d72>   DW_AT_name        : (indirect string, offset: 0x64cd0): _LoRa
    <d76>   DW_AT_decl_file   : 1
    <d76>   DW_AT_decl_line   : 60
    <d77>   DW_AT_decl_column : 26
    <d78>   DW_AT_type        : <0x7c8>
    <d7c>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><d7f>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <d80>   DW_AT_name        : (indirect string, offset: 0x838ba): mode
    <d84>   DW_AT_decl_file   : 1
    <d84>   DW_AT_decl_line   : 60
    <d85>   DW_AT_decl_column : 37
    <d86>   DW_AT_type        : <0x86>
    <d8a>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><d8d>: Abbrev Number: 13 (DW_TAG_variable)
    <d8e>   DW_AT_name        : (indirect string, offset: 0x1209e): read
    <d92>   DW_AT_decl_file   : 1
    <d92>   DW_AT_decl_line   : 61
    <d93>   DW_AT_decl_column : 13
    <d94>   DW_AT_type        : <0x94>
    <d98>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><d9b>: Abbrev Number: 13 (DW_TAG_variable)
    <d9c>   DW_AT_name        : (indirect string, offset: 0x6b2e7): data
    <da0>   DW_AT_decl_file   : 1
    <da0>   DW_AT_decl_line   : 62
    <da1>   DW_AT_decl_column : 13
    <da2>   DW_AT_type        : <0x94>
    <da6>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <2><da9>: Abbrev Number: 0
 <1><daa>: Abbrev Number: 12 (DW_TAG_subprogram)
    <dab>   DW_AT_external    : 1
    <dab>   DW_AT_name        : (indirect string, offset: 0x55a6c): LoRa_reset
    <daf>   DW_AT_decl_file   : 1
    <daf>   DW_AT_decl_line   : 42
    <db0>   DW_AT_decl_column : 6
    <db0>   DW_AT_prototyped  : 1
    <db0>   DW_AT_low_pc      : 0x8000c26
    <db4>   DW_AT_high_pc     : 0x3c
    <db8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <dba>   DW_AT_call_all_tail_calls: 1
    <dba>   DW_AT_sibling     : <0xdcd>
 <2><dbe>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <dbf>   DW_AT_name        : (indirect string, offset: 0x64cd0): _LoRa
    <dc3>   DW_AT_decl_file   : 1
    <dc3>   DW_AT_decl_line   : 42
    <dc4>   DW_AT_decl_column : 23
    <dc5>   DW_AT_type        : <0x7c8>
    <dc9>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><dcc>: Abbrev Number: 0
 <1><dcd>: Abbrev Number: 39 (DW_TAG_subprogram)
    <dce>   DW_AT_external    : 1
    <dce>   DW_AT_name        : (indirect string, offset: 0x20c62): newLoRa
    <dd2>   DW_AT_decl_file   : 1
    <dd3>   DW_AT_decl_line   : 19
    <dd4>   DW_AT_decl_column : 6
    <dd5>   DW_AT_prototyped  : 1
    <dd5>   DW_AT_type        : <0x6e0>
    <dd9>   DW_AT_low_pc      : 0x8000bd4
    <ddd>   DW_AT_high_pc     : 0x52
    <de1>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <de3>   DW_AT_call_all_calls: 1
 <2><de3>: Abbrev Number: 13 (DW_TAG_variable)
    <de4>   DW_AT_name        : (indirect string, offset: 0x64ccd): new_LoRa
    <de8>   DW_AT_decl_file   : 1
    <de8>   DW_AT_decl_line   : 20
    <de9>   DW_AT_decl_column : 7
    <dea>   DW_AT_type        : <0x6e0>
    <dee>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <2><df1>: Abbrev Number: 0
 <1><df2>: Abbrev Number: 0
  Compilation Unit @ offset 0xdf3:
   Length:        0xc1a (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x28a
   Pointer Size:  4
 <0><dff>: Abbrev Number: 28 (DW_TAG_compile_unit)
    <e00>   DW_AT_producer    : (indirect string, offset: 0x19623): GNU C11 12.3.1 20230626 -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <e04>   DW_AT_language    : 29	(C11)
    <e05>   DW_AT_name        : (indirect string, offset: 0x7f45c): ../Core/Src/main.c
    <e09>   DW_AT_comp_dir    : (indirect string, offset: 0xcacb): C:/Users/buikh/workspace/MY_THESIS/STM32_SCRIPT/f103_lora_test/lora_sender/Debug
    <e0d>   DW_AT_ranges      : 0xa2
    <e11>   DW_AT_low_pc      : 0
    <e15>   DW_AT_stmt_list   : 0xb68
    <e19>   DW_AT_macros      : 0x151ad
 <1><e1d>: Abbrev Number: 8 (DW_TAG_base_type)
    <e1e>   DW_AT_byte_size   : 1
    <e1f>   DW_AT_encoding    : 6	(signed char)
    <e20>   DW_AT_name        : (indirect string, offset: 0x3e9ee): signed char
 <1><e24>: Abbrev Number: 4 (DW_TAG_typedef)
    <e25>   DW_AT_name        : (indirect string, offset: 0x24d39): __uint8_t
    <e29>   DW_AT_decl_file   : 3
    <e2a>   DW_AT_decl_line   : 43
    <e2b>   DW_AT_decl_column : 24
    <e2c>   DW_AT_type        : <0xe30>
 <1><e30>: Abbrev Number: 8 (DW_TAG_base_type)
    <e31>   DW_AT_byte_size   : 1
    <e32>   DW_AT_encoding    : 8	(unsigned char)
    <e33>   DW_AT_name        : (indirect string, offset: 0x19b67): unsigned char
 <1><e37>: Abbrev Number: 8 (DW_TAG_base_type)
    <e38>   DW_AT_byte_size   : 2
    <e39>   DW_AT_encoding    : 5	(signed)
    <e3a>   DW_AT_name        : (indirect string, offset: 0x5cb1d): short int
 <1><e3e>: Abbrev Number: 4 (DW_TAG_typedef)
    <e3f>   DW_AT_name        : (indirect string, offset: 0x65ec4): __uint16_t
    <e43>   DW_AT_decl_file   : 3
    <e44>   DW_AT_decl_line   : 57
    <e45>   DW_AT_decl_column : 25
    <e46>   DW_AT_type        : <0xe4a>
 <1><e4a>: Abbrev Number: 8 (DW_TAG_base_type)
    <e4b>   DW_AT_byte_size   : 2
    <e4c>   DW_AT_encoding    : 7	(unsigned)
    <e4d>   DW_AT_name        : (indirect string, offset: 0x29362): short unsigned int
 <1><e51>: Abbrev Number: 8 (DW_TAG_base_type)
    <e52>   DW_AT_byte_size   : 4
    <e53>   DW_AT_encoding    : 5	(signed)
    <e54>   DW_AT_name        : (indirect string, offset: 0xafda): long int
 <1><e58>: Abbrev Number: 4 (DW_TAG_typedef)
    <e59>   DW_AT_name        : (indirect string, offset: 0x4f622): __uint32_t
    <e5d>   DW_AT_decl_file   : 3
    <e5e>   DW_AT_decl_line   : 79
    <e5f>   DW_AT_decl_column : 25
    <e60>   DW_AT_type        : <0xe64>
 <1><e64>: Abbrev Number: 8 (DW_TAG_base_type)
    <e65>   DW_AT_byte_size   : 4
    <e66>   DW_AT_encoding    : 7	(unsigned)
    <e67>   DW_AT_name        : (indirect string, offset: 0x1db32): long unsigned int
 <1><e6b>: Abbrev Number: 8 (DW_TAG_base_type)
    <e6c>   DW_AT_byte_size   : 8
    <e6d>   DW_AT_encoding    : 5	(signed)
    <e6e>   DW_AT_name        : (indirect string, offset: 0x39656): long long int
 <1><e72>: Abbrev Number: 8 (DW_TAG_base_type)
    <e73>   DW_AT_byte_size   : 8
    <e74>   DW_AT_encoding    : 7	(unsigned)
    <e75>   DW_AT_name        : (indirect string, offset: 0x1a28e): long long unsigned int
 <1><e79>: Abbrev Number: 29 (DW_TAG_base_type)
    <e7a>   DW_AT_byte_size   : 4
    <e7b>   DW_AT_encoding    : 5	(signed)
    <e7c>   DW_AT_name        : int
 <1><e80>: Abbrev Number: 8 (DW_TAG_base_type)
    <e81>   DW_AT_byte_size   : 4
    <e82>   DW_AT_encoding    : 7	(unsigned)
    <e83>   DW_AT_name        : (indirect string, offset: 0xa96b): unsigned int
 <1><e87>: Abbrev Number: 4 (DW_TAG_typedef)
    <e88>   DW_AT_name        : (indirect string, offset: 0x24d3b): uint8_t
    <e8c>   DW_AT_decl_file   : 4
    <e8d>   DW_AT_decl_line   : 24
    <e8e>   DW_AT_decl_column : 19
    <e8f>   DW_AT_type        : <0xe24>
 <1><e93>: Abbrev Number: 30 (DW_TAG_const_type)
    <e94>   DW_AT_type        : <0xe87>
 <1><e98>: Abbrev Number: 4 (DW_TAG_typedef)
    <e99>   DW_AT_name        : (indirect string, offset: 0x65ec6): uint16_t
    <e9d>   DW_AT_decl_file   : 4
    <e9e>   DW_AT_decl_line   : 36
    <e9f>   DW_AT_decl_column : 20
    <ea0>   DW_AT_type        : <0xe3e>
 <1><ea4>: Abbrev Number: 15 (DW_TAG_volatile_type)
    <ea5>   DW_AT_type        : <0xe98>
 <1><ea9>: Abbrev Number: 4 (DW_TAG_typedef)
    <eaa>   DW_AT_name        : (indirect string, offset: 0x4f624): uint32_t
    <eae>   DW_AT_decl_file   : 4
    <eaf>   DW_AT_decl_line   : 48
    <eb0>   DW_AT_decl_column : 20
    <eb1>   DW_AT_type        : <0xe58>
 <1><eb5>: Abbrev Number: 15 (DW_TAG_volatile_type)
    <eb6>   DW_AT_type        : <0xea9>
 <1><eba>: Abbrev Number: 12 (DW_TAG_structure_type)
    <ebb>   DW_AT_byte_size   : 16
    <ebc>   DW_AT_decl_file   : 5
    <ebc>   DW_AT_decl_line   : 290
    <ebe>   DW_AT_decl_column : 9
    <ebe>   DW_AT_sibling     : <0xef3>
 <2><ec2>: Abbrev Number: 7 (DW_TAG_member)
    <ec3>   DW_AT_name        : CCR
    <ec7>   DW_AT_decl_file   : 5
    <ec7>   DW_AT_decl_line   : 292
    <ec9>   DW_AT_decl_column : 17
    <ec9>   DW_AT_type        : <0xeb5>
    <ecd>   DW_AT_data_member_location: 0
 <2><ece>: Abbrev Number: 5 (DW_TAG_member)
    <ecf>   DW_AT_name        : (indirect string, offset: 0x306c8): CNDTR
    <ed3>   DW_AT_decl_file   : 5
    <ed3>   DW_AT_decl_line   : 293
    <ed5>   DW_AT_decl_column : 17
    <ed5>   DW_AT_type        : <0xeb5>
    <ed9>   DW_AT_data_member_location: 4
 <2><eda>: Abbrev Number: 5 (DW_TAG_member)
    <edb>   DW_AT_name        : (indirect string, offset: 0x77877): CPAR
    <edf>   DW_AT_decl_file   : 5
    <edf>   DW_AT_decl_line   : 294
    <ee1>   DW_AT_decl_column : 17
    <ee1>   DW_AT_type        : <0xeb5>
    <ee5>   DW_AT_data_member_location: 8
 <2><ee6>: Abbrev Number: 5 (DW_TAG_member)
    <ee7>   DW_AT_name        : (indirect string, offset: 0x44ed6): CMAR
    <eeb>   DW_AT_decl_file   : 5
    <eeb>   DW_AT_decl_line   : 295
    <eed>   DW_AT_decl_column : 17
    <eed>   DW_AT_type        : <0xeb5>
    <ef1>   DW_AT_data_member_location: 12
 <2><ef2>: Abbrev Number: 0
 <1><ef3>: Abbrev Number: 9 (DW_TAG_typedef)
    <ef4>   DW_AT_name        : (indirect string, offset: 0x65708): DMA_Channel_TypeDef
    <ef8>   DW_AT_decl_file   : 5
    <ef9>   DW_AT_decl_line   : 296
    <efb>   DW_AT_decl_column : 3
    <efb>   DW_AT_type        : <0xeba>
 <1><eff>: Abbrev Number: 12 (DW_TAG_structure_type)
    <f00>   DW_AT_byte_size   : 8
    <f01>   DW_AT_decl_file   : 5
    <f01>   DW_AT_decl_line   : 298
    <f03>   DW_AT_decl_column : 9
    <f03>   DW_AT_sibling     : <0xf20>
 <2><f07>: Abbrev Number: 7 (DW_TAG_member)
    <f08>   DW_AT_name        : ISR
    <f0c>   DW_AT_decl_file   : 5
    <f0c>   DW_AT_decl_line   : 300
    <f0e>   DW_AT_decl_column : 17
    <f0e>   DW_AT_type        : <0xeb5>
    <f12>   DW_AT_data_member_location: 0
 <2><f13>: Abbrev Number: 5 (DW_TAG_member)
    <f14>   DW_AT_name        : (indirect string, offset: 0x577ad): IFCR
    <f18>   DW_AT_decl_file   : 5
    <f18>   DW_AT_decl_line   : 301
    <f1a>   DW_AT_decl_column : 17
    <f1a>   DW_AT_type        : <0xeb5>
    <f1e>   DW_AT_data_member_location: 4
 <2><f1f>: Abbrev Number: 0
 <1><f20>: Abbrev Number: 9 (DW_TAG_typedef)
    <f21>   DW_AT_name        : (indirect string, offset: 0x2da79): DMA_TypeDef
    <f25>   DW_AT_decl_file   : 5
    <f26>   DW_AT_decl_line   : 302
    <f28>   DW_AT_decl_column : 3
    <f28>   DW_AT_type        : <0xeff>
 <1><f2c>: Abbrev Number: 12 (DW_TAG_structure_type)
    <f2d>   DW_AT_byte_size   : 28
    <f2e>   DW_AT_decl_file   : 5
    <f2e>   DW_AT_decl_line   : 357
    <f30>   DW_AT_decl_column : 9
    <f30>   DW_AT_sibling     : <0xf89>
 <2><f34>: Abbrev Number: 7 (DW_TAG_member)
    <f35>   DW_AT_name        : CRL
    <f39>   DW_AT_decl_file   : 5
    <f39>   DW_AT_decl_line   : 359
    <f3b>   DW_AT_decl_column : 17
    <f3b>   DW_AT_type        : <0xeb5>
    <f3f>   DW_AT_data_member_location: 0
 <2><f40>: Abbrev Number: 7 (DW_TAG_member)
    <f41>   DW_AT_name        : CRH
    <f45>   DW_AT_decl_file   : 5
    <f45>   DW_AT_decl_line   : 360
    <f47>   DW_AT_decl_column : 17
    <f47>   DW_AT_type        : <0xeb5>
    <f4b>   DW_AT_data_member_location: 4
 <2><f4c>: Abbrev Number: 7 (DW_TAG_member)
    <f4d>   DW_AT_name        : IDR
    <f51>   DW_AT_decl_file   : 5
    <f51>   DW_AT_decl_line   : 361
    <f53>   DW_AT_decl_column : 17
    <f53>   DW_AT_type        : <0xeb5>
    <f57>   DW_AT_data_member_location: 8
 <2><f58>: Abbrev Number: 7 (DW_TAG_member)
    <f59>   DW_AT_name        : ODR
    <f5d>   DW_AT_decl_file   : 5
    <f5d>   DW_AT_decl_line   : 362
    <f5f>   DW_AT_decl_column : 17
    <f5f>   DW_AT_type        : <0xeb5>
    <f63>   DW_AT_data_member_location: 12
 <2><f64>: Abbrev Number: 5 (DW_TAG_member)
    <f65>   DW_AT_name        : (indirect string, offset: 0x1c2f0): BSRR
    <f69>   DW_AT_decl_file   : 5
    <f69>   DW_AT_decl_line   : 363
    <f6b>   DW_AT_decl_column : 17
    <f6b>   DW_AT_type        : <0xeb5>
    <f6f>   DW_AT_data_member_location: 16
 <2><f70>: Abbrev Number: 7 (DW_TAG_member)
    <f71>   DW_AT_name        : BRR
    <f75>   DW_AT_decl_file   : 5
    <f75>   DW_AT_decl_line   : 364
    <f77>   DW_AT_decl_column : 17
    <f77>   DW_AT_type        : <0xeb5>
    <f7b>   DW_AT_data_member_location: 20
 <2><f7c>: Abbrev Number: 5 (DW_TAG_member)
    <f7d>   DW_AT_name        : (indirect string, offset: 0x6aec3): LCKR
    <f81>   DW_AT_decl_file   : 5
    <f81>   DW_AT_decl_line   : 365
    <f83>   DW_AT_decl_column : 17
    <f83>   DW_AT_type        : <0xeb5>
    <f87>   DW_AT_data_member_location: 24
 <2><f88>: Abbrev Number: 0
 <1><f89>: Abbrev Number: 9 (DW_TAG_typedef)
    <f8a>   DW_AT_name        : (indirect string, offset: 0x7828d): GPIO_TypeDef
    <f8e>   DW_AT_decl_file   : 5
    <f8f>   DW_AT_decl_line   : 366
    <f91>   DW_AT_decl_column : 3
    <f91>   DW_AT_type        : <0xf2c>
 <1><f95>: Abbrev Number: 12 (DW_TAG_structure_type)
    <f96>   DW_AT_byte_size   : 40
    <f97>   DW_AT_decl_file   : 5
    <f97>   DW_AT_decl_line   : 423
    <f99>   DW_AT_decl_column : 9
    <f99>   DW_AT_sibling     : <0x1015>
 <2><f9d>: Abbrev Number: 7 (DW_TAG_member)
    <f9e>   DW_AT_name        : CR
    <fa1>   DW_AT_decl_file   : 5
    <fa1>   DW_AT_decl_line   : 425
    <fa3>   DW_AT_decl_column : 17
    <fa3>   DW_AT_type        : <0xeb5>
    <fa7>   DW_AT_data_member_location: 0
 <2><fa8>: Abbrev Number: 5 (DW_TAG_member)
    <fa9>   DW_AT_name        : (indirect string, offset: 0x7a749): CFGR
    <fad>   DW_AT_decl_file   : 5
    <fad>   DW_AT_decl_line   : 426
    <faf>   DW_AT_decl_column : 17
    <faf>   DW_AT_type        : <0xeb5>
    <fb3>   DW_AT_data_member_location: 4
 <2><fb4>: Abbrev Number: 7 (DW_TAG_member)
    <fb5>   DW_AT_name        : CIR
    <fb9>   DW_AT_decl_file   : 5
    <fb9>   DW_AT_decl_line   : 427
    <fbb>   DW_AT_decl_column : 17
    <fbb>   DW_AT_type        : <0xeb5>
    <fbf>   DW_AT_data_member_location: 8
 <2><fc0>: Abbrev Number: 5 (DW_TAG_member)
    <fc1>   DW_AT_name        : (indirect string, offset: 0x7dd73): APB2RSTR
    <fc5>   DW_AT_decl_file   : 5
    <fc5>   DW_AT_decl_line   : 428
    <fc7>   DW_AT_decl_column : 17
    <fc7>   DW_AT_type        : <0xeb5>
    <fcb>   DW_AT_data_member_location: 12
 <2><fcc>: Abbrev Number: 5 (DW_TAG_member)
    <fcd>   DW_AT_name        : (indirect string, offset: 0x7cde5): APB1RSTR
    <fd1>   DW_AT_decl_file   : 5
    <fd1>   DW_AT_decl_line   : 429
    <fd3>   DW_AT_decl_column : 17
    <fd3>   DW_AT_type        : <0xeb5>
    <fd7>   DW_AT_data_member_location: 16
 <2><fd8>: Abbrev Number: 5 (DW_TAG_member)
    <fd9>   DW_AT_name        : (indirect string, offset: 0x7cccc): AHBENR
    <fdd>   DW_AT_decl_file   : 5
    <fdd>   DW_AT_decl_line   : 430
    <fdf>   DW_AT_decl_column : 17
    <fdf>   DW_AT_type        : <0xeb5>
    <fe3>   DW_AT_data_member_location: 20
 <2><fe4>: Abbrev Number: 5 (DW_TAG_member)
    <fe5>   DW_AT_name        : (indirect string, offset: 0x7def8): APB2ENR
    <fe9>   DW_AT_decl_file   : 5
    <fe9>   DW_AT_decl_line   : 431
    <feb>   DW_AT_decl_column : 17
    <feb>   DW_AT_type        : <0xeb5>
    <fef>   DW_AT_data_member_location: 24
 <2><ff0>: Abbrev Number: 5 (DW_TAG_member)
    <ff1>   DW_AT_name        : (indirect string, offset: 0x7ece9): APB1ENR
    <ff5>   DW_AT_decl_file   : 5
    <ff5>   DW_AT_decl_line   : 432
    <ff7>   DW_AT_decl_column : 17
    <ff7>   DW_AT_type        : <0xeb5>
    <ffb>   DW_AT_data_member_location: 28
 <2><ffc>: Abbrev Number: 5 (DW_TAG_member)
    <ffd>   DW_AT_name        : (indirect string, offset: 0x7ce9d): BDCR
    <1001>   DW_AT_decl_file   : 5
    <1001>   DW_AT_decl_line   : 433
    <1003>   DW_AT_decl_column : 17
    <1003>   DW_AT_type        : <0xeb5>
    <1007>   DW_AT_data_member_location: 32
 <2><1008>: Abbrev Number: 7 (DW_TAG_member)
    <1009>   DW_AT_name        : CSR
    <100d>   DW_AT_decl_file   : 5
    <100d>   DW_AT_decl_line   : 434
    <100f>   DW_AT_decl_column : 17
    <100f>   DW_AT_type        : <0xeb5>
    <1013>   DW_AT_data_member_location: 36
 <2><1014>: Abbrev Number: 0
 <1><1015>: Abbrev Number: 9 (DW_TAG_typedef)
    <1016>   DW_AT_name        : (indirect string, offset: 0x7deb5): RCC_TypeDef
    <101a>   DW_AT_decl_file   : 5
    <101b>   DW_AT_decl_line   : 437
    <101d>   DW_AT_decl_column : 3
    <101d>   DW_AT_type        : <0xf95>
 <1><1021>: Abbrev Number: 12 (DW_TAG_structure_type)
    <1022>   DW_AT_byte_size   : 32
    <1023>   DW_AT_decl_file   : 5
    <1023>   DW_AT_decl_line   : 461
    <1025>   DW_AT_decl_column : 9
    <1025>   DW_AT_sibling     : <0x1088>
 <2><1029>: Abbrev Number: 7 (DW_TAG_member)
    <102a>   DW_AT_name        : CR1
    <102e>   DW_AT_decl_file   : 5
    <102e>   DW_AT_decl_line   : 463
    <1030>   DW_AT_decl_column : 17
    <1030>   DW_AT_type        : <0xeb5>
    <1034>   DW_AT_data_member_location: 0
 <2><1035>: Abbrev Number: 7 (DW_TAG_member)
    <1036>   DW_AT_name        : CR2
    <103a>   DW_AT_decl_file   : 5
    <103a>   DW_AT_decl_line   : 464
